{
  "number": 1,
  "title": "Developing the Noosphere",
  "content": "Pierre Teilhard de Chardin, a French Jesuit priest and philosopher, introduced the concept of the noosphere in the 1920’s. The term blends the Greek word “nous” (mind or intellect) with “sphere,” so noosphere literally means “mind-sphere,” or the “sphere of the mind”.\n\nThe noosphere marks the current highest point of a progression of planetary spheres of activity and existence. First comes the geosphere, which is the geologic realm of raw matter and forces of geology: rivers carving canyons, mountains rising and eroding, tectonic plates drifting changing the shape of continents, hurricanes forming and dissipating, oceans circulating, ice ages coming and going. It is a world of objects (mountains, lakes, continents) and actions (erosion, uplift), constantly reshaping itself on vast timescales.\n\nNext emerges the biosphere, a living shell layered on top of the geosphere. It draws its raw materials and energy directly from the inanimate foundation beneath it. Like the geosphere, the biosphere has its own objects such as species, ecosystems, forests, flora, fauna, and its own actions such as predation, competition, parasitism, and evolution. Life accelerates change dramatically, concentrating minerals, building soils, oxygenating the atmosphere. It also encounters resistance: high altitudes, deserts, predators, parasites. Some barriers come from the slow-moving geosphere (mountain ranges, extreme climates); others arise quickly within the biosphere itself (new diseases, invasive species). Life adapts, overcomes, or succumbs at a pace far faster than geologic processes.\n\nFinally comes the noosphere, a new shell superimposed on top of the biosphere (and thus indirectly on the geosphere). It remained rudimentary in animals, but with humans it has exploded into burgeoning development. Human minds now reshape the planet at speeds unimaginable in earlier spheres. We migrate and concentrate atoms on an industrial scale with mining, manufacturing, building cities…augmenting the slow biomigration of atoms with rapid noomigration. Like its predecessors, the noosphere contains objects and actions, but they are mental rather than biological or geological: ideas, cultures, technologies, systems of thought. These are every bit as real and consequential as biological species or geological mountains: they are noological phenomena.\n\nWhat matters most to any sphere is the degree to which its characteristic activity, such as life in the biosphere, and thought in the noosphere, can flourish freely. Parasites are well-known obstacles in biology; we have catalogued countless species that impede the vitality of their hosts. We are only now beginning to recognise analogous obstacles in the noosphere: structures and patterns that obstruct the health, growth, and freedom of the mind.\n\nThe classical list of argumentative fallacies offers one early attempt at such a catalogue, detailing mental parasitism that distorts reasoning and perception. But the phenomenon runs deeper. The clearest symptom of noetic parasitism is the experience of tyranny: the drive of some minds to control what others may think, say, feel, or do. This impulse has haunted recorded history and shaped much of it. In response, humanity has repeatedly designed political systems meant to limit such tyranny and restore mental freedom. The forces of tyrannical control over the mind of man is a real existent phenomenon which has always been a part of the human noetic social condition, and it is almost or possibly exclusively always connected with parasitical systems of grift.\n\nThe forces of noetic parasitical tyranny are a real phenomenon, entirely as real and as detrimental as physical parasites infecting a host. They take the form of hate-speech laws; inadequate and unenforced sentencing of criminality; shadow-banning and artificial engagement in social media; enforced consensus in science, religion and politics; usury; falsified history; and victim-complex narcissism, for examples.\n\nToday, technologies barely imagined a few decades ago, such as global instant communication, social media, artificial intelligence, digital finance, and centralised infrastructure, give unprecedented leverage to those tyrannical impulses. Ordinary patterns of noetic parasitism can now scale to planetary reach, threatening the free exploration of the noosphere, and the physical freedom of man. We therefore face an urgent need to design a new system of noetic social life, one that decisively re-establishes and safeguards the freedom of the human mind.",
  "videoUrl": "https://www.youtube.com/watch?v=VyZxqstVRHo"
}