{
  "number": 21,
  "title": "Health and Medical Care",
  "content": "1.     Every human being present on Canadian soil, whether citizen, resident, or visitor, possesses the inviolable right to immediate emergency medical care of the highest merit-evaluated standard of care, as determined by the Medical Price and Practice Board based on proven, evidence-based protocols, necessary to preserve life or prevent permanent disability in cases of accidental injury, acute medical crisis, or the natural process of childbirth.\n\n2.     All non-emergency medical treatment, all treatment of chronic or lifestyle-related conditions, and all ongoing pharmaceutical or therapeutic care shall be the sole responsibility of the individual and shall be obtained through private insurance or direct payment.\n\n3.     Every Canadian citizen from the moment of conception until the age of eighteen, and every citizen of any age suffering from a verified congenital or unavoidable medical condition requiring continuous treatment for survival or basic function, shall receive full medical coverage without premium or co-payment, funded by the state.\n\n4.     The medical insurance industry shall operate under strict oversight to prevent price gouging, denial of legitimate claims, or unnecessary delay or withholding of covered treatment. Any insurer found guilty of systematic abuse of patients or inflationary practices shall have its licence permanently revoked and its officers held personally liable.\n\n5.     Providers of medical goods and services (physicians, surgeons, hospitals, clinics, pharmaceutical manufacturers, medical-device companies, diagnostic laboratories, and any other entity billing for health-related products or services) are likewise subject to strict oversight by an independent Medical Price and Practice Board. Prohibited practices include, but are not limited to:\n      a)     price gouging or collusive pricing above reasonable cost-plus-fair-profit margins as determined annually by the Board;\n      b)     refusal to publish transparent, all-in pricing in advance of treatment;\n      c)     balance-billing patients beyond published prices;\n      d)     tying or bundling of services to force purchase of unnecessary procedures or products;\n      e)     paying or receiving kickbacks, referral fees, or any inducement for patient steering.\n      Violation by any licensed provider or corporate officer shall result in permanent loss of licence to practise or sell in the Republic, personal fines of up to ten times the illicit gain, and imprisonment for repeat or egregious offences.\n\n6.     The Medical Price and Practice Board shall consist of five members appointed for single ten-year terms.\n      a)     two qualified health experts chosen by lot from the National Registry of Qualified Experts;\n      b)     one lay-citizen chosen by lot from the National Registry of Citizens;\n      c)     one economist or actuary chosen by lot from National Registry of Qualified Experts; and\n      d)     one member chosen by the Supreme Court from the senior judiciary.\n      No member may have held any financial interest in a medical or pharmaceutical or any health-related enterprise in the previous five years nor may they during tenure of term. Members shall serve full-time, except the judicial member who may retain concurrent duties. Non-judicial members shall receive annual compensation fixed at three times the national median wage. The judicial member shall retain their standard judicial compensation as per Article 14.\n\n7.     Generic and off-patent pharmaceuticals, basic medical devices, and common surgical procedures shall be subject to reference pricing based on the lowest responsible international benchmark; no provider or manufacturer may charge citizens of the Republic more than 110 % of that benchmark.\n\n8.     Coerced or fraudulent harvesting of organs or placentas shall be punishable as a crime involving force or fraud under Article 15, with penalties including up to life imprisonment for acts causing death or irreversible harm. Institutions or professionals found in violation shall face dissolution, licence revocation, and treble damages to affected parties or their heirs.\n\n9.     Organ and tissue harvesting, including from the placenta, shall be prohibited except in cases of voluntary, informed donation by competent adults, and solely for merit-proven therapeutic or research purposes that advance the health and continuity of the Republic’s citizens. All such donations must be altruistic, without financial incentive, and overseen by independent merit-based tribunals to ensure no coercion or fraud. All collection, storage, or use of human tissues, organs, or placentas within the national health system shall adhere to transparent, merit-evaluated protocols established by the House. These protocols must prioritize evidence-based benefits to citizens, require verifiable informed consent, and prohibit any form of presumption, opt-out schemes, or linkage to end-of-life decisions. Merit-based audits shall occur annually to ensure compliance.\n\n10.    Commercialization, sale, or unregulated use of harvested organs, placentas, or tissues is forbidden. Placentas may be retained by the mother for personal or cultural use but shall not be harvested without her explicit consent. Violations, including by medical professionals or institutions, shall be classified as fraud or force, punishable by imprisonment, licence revocation, and fines payable to the sovereign wealth fund.",
  "precis": "Article 21 establishes health and medical care as a meritocratic balance between individual responsibility and communal protection in the Meritocratic Republic of Canada, reflecting the European settlers’ ethos of self-reliance tempered by solidarity that enabled survival in a rugged frontier. In an era where healthcare systems have ballooned into bureaucratic monoliths, fostering dependency, price inflation, and ideological capture, this provision ensures universal access to life-saving emergency care while relegating non-critical treatments to private means, securing the freedom of personal choice in wellness without subsidizing lifestyle excesses that drain public resources. By providing full coverage for children up to eighteen and those with unavoidable conditions from conception onward, it upholds positive eugenics by investing in the vitality of future generations, particularly the European-descended majority, preventing the crimes of neglect that exacerbate demographic decline and cultural erosion seen in modern welfare states. This framework counters the perils of socialized medicine that have led to rationing, waitlists, and coerced interventions, promoting instead a system where merit-driven innovation thrives through competitive, transparent markets unburdened by overregulation.\n\nCentral to Article 21 is the rigorous oversight of insurers and providers via the Medical Price and Practice Board, which deters crimes like price gouging, kickbacks, and fraudulent denials through permanent licence revocations and personal liabilities, ensuring that medical excellence serves the people rather than profiteers. Reference pricing for generics and prohibitions on opaque billing foster affordability and accountability, addressing historical abuses where pharmaceutical cartels have inflated costs to exploit vulnerabilities, while protocols for human tissues prioritize verifiable consent. By classifying coerced organ harvesting as a severe offense under judicial penalties, it protects bodily integrity and prevents the commodification of life that has emerged in global black markets, reinforcing the Republic’s commitment to human primacy and ethical merit in healthcare decisions that honor the European heritage of rational, compassionate governance.\n\nFurthermore, in anticipating future threats from biotechnologies like genetic editing or AI-diagnostic monopolies that could enable surveillance or selective culling, Article 21 fortifies freedoms through independent audits and merit-evaluated protocols, ensuring that medical advancements enhance rather than undermine the human experience of autonomy. This preserves the cultural continuity of European posterity by barring presumptive consent schemes or linkages to end-of-life decisions, resilient amid emerging vectors of tyranny such as digital health passports or engineered pandemics. In doing so, the Article guarantees a meritocracy where health serves as a foundation for national strength, protecting generations from the distortions of supranational health agendas or corporate overreach that threaten liberty."
}