{
  "number": 17,
  "title": "Marriage, Divorce, and the Protection of the Family",
  "content": "1.     Marriage is the lifelong union of one man and one woman to the exclusion of all others and may be entered into only between such persons. No law, regulation, or judicial decision may recognise any other form of union as marriage or confer upon it the legal incidents of marriage. The natural family of father, mother, and their children is recognised as the fundamental unit of society; no policy shall undermine its stability or authority. The state shall actively encourage high fertility among married couples through policies that honour parenthood as the highest civic virtue.\n\n2.     Each parent in a married couple shall be entitled, upon the birth or adoption of each child, to one full year of paid parental leave which may be taken concurrently or consecutively with absolute guarantee of return to the same or equivalent position for each parent. Employment protection during this leave is inviolable.\n     Funding shall come from the Family Insurance Fund (FIF), into which all citizens pay an annual premium of 1.5 % of their insurable earnings up to the Maximum Insurable Earnings (MIE) set annually at 1.5 times the national median wage. To qualify for full benefits, the claimant must have at least 300 hours of insurable employment in the prior 52 weeks.\n     The state payment shall replace 100 % of the higher-earning spouse’s verified average annual insurable earnings over the previous 24 months, subject to:\n         a)     A hard cap of the MIE;\n         b)     A minimum floor of the national median wage for qualified claimants; and\n         c)     A clawback of 30 % of benefits received if the family’s post-benefit net income exceeds twice the median wage in the following tax year.\n     Benefits are non-means-tested beyond contributions and the clawback. If one parent remains home full-time thereafter to raise the couple’s minor children until the youngest child reaches the age of fourteen, that parent qualifies for the means-tested support under Article 27, section 4, assessed against total family assets and income, for the duration of that period.\n\n3.     A permanent, ring-fenced Family Insurance Fund is hereby established for the sole purpose of paying the parental-leave benefits provided in section 2 and the ongoing family-carer support provided in Article 27, section 4.\n         a)     The Fund shall be financed exclusively by a dedicated 1.5 % contributory premium levied solely on employers in respect of each citizen employee’s insurable earnings up to the Maximum Insurable Earnings described in section 6. No general revenue, sovereign-wealth-fund monies, or borrowed funds may ever be used to supplement or replace these premiums.\n         b)     All premiums collected shall be deposited into a constitutionally protected account separate from all other public monies. No legislature, minister, or court may redirect, freeze, borrow from, or encumber the Fund for any other purpose whatsoever.\n         c)     Any annual surplus in the Fund shall be used only to reduce the premium rate in the following year or to increase the Maximum Insurable Earnings cap. Any deficit shall be covered only by a temporary premium increase; benefits may never be reduced or delayed.\n         d)     The Fund shall be administered by a three-member board appointed for single twelve-year terms by the Prime Minister with two-thirds approval of the House of the Republic. Board members must be citizens of unmixed European descent with demonstrated expertise in actuarial science or family demography and no financial ties to any private insurance entity.\n         e)     Full actuarial tables, premium rates, reserve levels, and payout statistics shall be published annually and are subject to mandatory audit by the Public Monetary Auditor established under Article 20.\n\n4.     Fraud and Multiple Claims Prohibited\n         a)     No individual may receive more than one form of support under this Article or related provisions (including parental leave benefits or ongoing family-carer support cross-referenced to Article 27, section 4), and each support claim shall apply solely to the care of a single dependent unit, defined as either one infirm relative or the claimant’s own minor children as a collective group. Overlapping claims, such as simultaneous support for child-rearing and infirm relatives, are prohibited.\n         b)     Fraudulent claims, including but not limited to false representations of eligibility, non-delivery of claimed care, or circumvention of means-testing, shall be classified as aggravated theft from the common treasury and the Family Insurance Fund. Upon conviction, the offender shall be punished by imprisonment of five to fifteen years, immediate repayment of all benefits received plus treble damages payable to the sovereign wealth fund, and permanent ineligibility for all public assistance programmes under this Constitution.\n\n5.     Divorce\n     Divorce exists solely as a remedy for marriages irretrievably broken on legitimate grounds, never as a state-sanctioned instrument of vengeance, spite, retribution, or legal warfare between spouses. The Republic prohibits the use of divorce proceedings or any claims, motions, or accusations therein primarily motivated by personal malice, punishment of a spurned partner, or intent to harass, defame, impoverish, or otherwise harm the other party absent proven grounds. Courts shall dismiss with prejudice any filings or elements found to be frivolous, malicious, or in bad faith, imposing sanctions on the offending party, including full costs, financial penalties, and potential loss of custodial or property considerations. Such abuses undermine the sanctity of marriage and family; the State shall neither facilitate nor tolerate them.\n     Divorce shall be granted solely on the grounds and according to the procedures set forth in the subsections below. Contested cases shall be resolved swiftly by a dedicated Family Court.\n         a)     Grounds for Divorce\n             i)      proven physical or psychological abuse of spouse or child;\n             ii)     proven infidelity;\n             iii)    mutual consent;\n             iv)     unilateral petition where the petitioner forfeits all claims to custody, visitation, and marital assets;\n             v)      unilateral petition when the other party has provably abandoned the family for more than six months, to be treated as forfeiture to all claims to custody, visitation, and marital assets by the other party.\n         b)     Rules for Contested Cases\n             i)      Marital property, equity, savings, pensions, and assets shall be divided equally within ninety days unless a valid prenuptial agreement provides otherwise.\n             ii)     Physical custody and decision-making authority for minor children shall be shared equally between fit parents, with no presumption favouring either mother or father. Financial child support shall reflect income disparity and actual time spent with the child.\n             iii)    Proven abuse (clear and convincing evidence) is the sole ground for denying custody or visitation. False or malicious allegations, once disproven, constitute perjury; the offender shall immediately forfeit all claims to custody, visitation, and assets in perpetuity.\n             iv)     No court may delay proceedings beyond the timelines herein. Any judge or lawyer who deliberately obstructs swift resolution shall be removed from office or disbarred and held personally liable for damages. Any party who deliberately obstructs or delays proceedings through bad-faith actions, such as frivolous filings or evasion of service, shall be held in contempt, fined up to 10 % of their share of the marital estate per instance, and may forfeit additional claims to assets, custody, or visitation at the court's discretion.\n         c)     Automatic Protections Upon Filing or Separation\n             From the moment one spouse files for divorce or legally separates, or from the moment one spouse is involuntarily excluded from the marital home or from joint financial accounts (whichever occurs first), the following automatic protections take effect by operation of law, without need for court order:\n                 i)      All joint credit cards, bank accounts, and lines of credit remain fully accessible to both spouses until final settlement. Unilateral cancellation or restriction is a felony punishable by 5–10 years’ imprisonment.\n                 ii)     The higher-earning or asset-holding spouse shall, commencing within 72 hours of separation or filing (whichever is earlier) and continuing monthly until final settlement, directly pay provisional support equal to fifty percent (50 %) of the marital standard of living (or the national median wage, whichever is higher) into any bank account designated by the dependent spouse.\n                 Failure to make any payment on time, or payment of less than the required amount, triggers an automatic daily penalty of 5 % of the missed amount (compounded) plus immediate forfeiture of an additional 10 % of the delinquent spouse’s final share of the marital estate for each missed or partial payment.\n                 Proof of payment (bank transfer records) is presumptive; deliberate non-compliance or evasion is punishable as felony theft from the dependent spouse.\n                 iii)    Neither spouse may sell, transfer, encumber, hide, dissipate, deplete, or wastefully expend marital assets. Violation triggers immediate forfeiture of that spouse’s entire claim to the affected asset, plus treble damages payable to the aggrieved spouse deducted from the offending spouse’s share of the remaining marital estate. If the deduction exceeds the offending spouse’s share, the shortfall shall become a personal debt owed to the aggrieved spouse, enforceable as a judgment lien against the offending spouse’s future earnings and non-marital assets.\n                 iv)     Any vehicle regularly used by the dependent spouse or for child transport may not be repossessed or disabled or have its license or insurance cancelled or be otherwise made inaccessible or legally or physically inoperable. Violation shall be considered grand theft and triggers immediate forfeiture of the offending spouse’s entire claim to that vehicle.\n         d)     Interim Orders\n             Within 30 days of filing or involuntary separation, the Family Court shall issue an interim order distributing:\n                 i)      sole interim use of the marital home to the primary caregiver of minor children (or to the lower-earning spouse if no minor children), and\n                 ii)     an immediate 50 % cash advance of all liquid marital assets (bank accounts, investments, crypto, etc.) to the dependent spouse, with final accounting at settlement. Deliberate delay by either party or by the court is punishable by contempt and personal financial liability of the delaying judge or lawyer.\n         e)     Special Forfeitures\n             Any spouse who abandons the marriage without proven fault (abuse, infidelity, or cruelty) and who was the primary breadwinner forfeits an additional 25 % of the marital estate to the dependent spouse as liquidated damages for destruction of the dependent spouse’s career and earning capacity.",
  "precis": "Article 17 elevates marriage and the natural family as the bedrock of the Meritocratic Republic of Canada, recognizing them as essential to sustaining the European heritage that built the nation through generations of commitment, resilience, and cultural continuity. In an era where ideological forces and economic pressures have fragmented families, leading to plummeting birth rates and societal instability, this provision defines marriage exclusively as the lifelong union between one man and one woman, aligning with the biological and historical realities that foster stable societies and meritocratic excellence. By prohibiting recognition of other unions and actively encouraging high fertility through generous parental leave and caregiver support, it secures the freedom of individuals to form enduring bonds without the distortions of transient cultural experiments, preventing the crimes of familial erosion that have contributed to demographic replacement and the loss of national vitality.\n\nCentral to Article 17 is the merit-based protection of children and dependent spouses through a dedicated, ring-fenced Family Insurance Fund that provides full-wage replacement for parental leave and ongoing support for full-time caregivers, honoring parenthood as the highest civic virtue while addressing contemporary challenges of work-life imbalance. By mandating swift, equitable resolutions in dedicated Family Courts—with even splits of assets, shared custody, and decision-making as the default, deviating only for proven cause—and classifying false allegations as perjury with immediate forfeiture of rights, it deters manipulative tactics that exploit judicial systems for personal advantage.\n\nDivorce is explicitly limited to a remedy for irretrievably broken marriages on legitimate grounds, never permitted as a state-sanctioned instrument of vengeance, spite, retribution, or legal warfare. Courts are empowered to dismiss frivolous or malicious filings with prejudice and impose severe sanctions, ensuring that proceedings cannot be weaponized to harass, defame, impoverish, or punish a spouse absent proven fault. Automatic protections upon separation—preserving access to joint finances, provisional support, and marital assets, with heavy penalties for violation—further shield dependent spouses and children from economic coercion or retaliation. These measures collectively safeguard family integrity against modern abuses of process that turn dissolution into prolonged punishment, promoting instead a society where merit flourishes through stable homes that nurture competent, virtuous posterity.\n\nThis forward-thinking framework preserves the human experience of familial freedom, guaranteeing that posterity inherits a meritocracy where strong families drive national strength rather than serve as battlegrounds for personal malice or cultural subversion, thus protecting the freedoms of love, legacy, and lineage rooted in the European character of the nation."
}