{
  "number": 16,
  "title": "Citizenship and the Franchise",
  "content": "The right to choose the government of the Republic and to initiate or approve binding referenda is the supreme political act of sovereignty. It belongs exclusively to citizens who bear the burdens and benefits of membership in the nation.\n\n1.     Only citizens of the Republic of Canada, as defined in Article 9, aged 25 years or more, may vote in any election or referendum, national, provincial, or municipal. Non-citizens, including permanent residents, are permanently and irrevocably excluded from the franchise.\n\n2.     Anonymous, cryptographically-secure, open-source digital voting systems whose complete source code and cryptographic design are permanently available for public inspection and independent audit shall be the primary method for all elections and referenda. Voting shall be accessible via secure applications on personal devices (such as computers or smartphones), enabling remote casting from home where feasible, with authentication tied to the National Registry of Citizens. Systems must incorporate end-to-end verifiability, coercion-resistance measures, and unbreakable anonymity. In-person polling options shall always remain available to accommodate citizens preferring controlled environments. Any attempt to sell, purchase, coerce, or otherwise unlawfully influence a vote, or to circumvent the cryptographic anonymity or integrity features of the voting system, shall be punishable as a felony against the Constitution, carrying a mandatory minimum sentence of seven years’ imprisonment and permanent disqualification from citizenship rights, including the right to vote or hold office.\n\n3.     In any area or circumstance where electric power or digital systems are unavailable, voting shall be conducted by secret paper ballot, hand-counted in public view, with results posted immediately at each polling station.\n\n4.     Minimum participation threshold\n      a)     No national election or binding national referendum shall be deemed valid unless at least sixty percent of eligible citizens cast a vote.\n      b)     No provincial or municipal election shall be deemed valid unless at least fifty percent of eligible citizens in that jurisdiction cast a vote.\n      c)     If the threshold is not met, the election or referendum is automatically void, and a new vote must be held within ninety days under the same rules. Repeated failure to meet the threshold shall trigger mandatory dissolution of the legislative body and fresh elections until the people choose to exercise their sovereignty.\n\n5.     Any official, electoral officer, or private entity that knowingly permits a non-citizen to vote, or that falsifies, suppresses, or manipulates voter eligibility or turnout records, commits a crime against the Constitution punishable by a mandatory minimum sentence of ten years’ imprisonment and permanent disqualification from public office or trust.",
  "precis": "Article 16 enshrines citizenship and the franchise (voting) as the ultimate expression of sovereignty in the Meritocratic Republic of Canada, ensuring that only those with a vested stake in the nation’s European heritage wield the power to shape its governance, thereby preserving the cultural and demographic continuity forged by the founding peoples. By restricting the vote to citizens aged 25 or older, this provision elevates participation to a mature, considered act, securing the freedom of self-rule for competent individuals while preventing the crimes of electoral dilution through non-citizen influence or youthful impulsivity that have undermined democracies elsewhere. In an era of global mobility and digital fraud, these measures counteract the existential threats of voter manipulation and foreign interference, fostering a meritocracy where excellence in civic engagement drives decisions, untainted by transient populations or ideological subversion that could erode the European-descended majority’s birthright.\n\nCentral to Article 16 is the adoption of secure, transparent voting systems, prioritizing anonymous, open-source digital cryptographic methods with fallback to public hand-counted paper ballots. Mandatory participation thresholds demand active sovereignty, invalidating low-turnout outcomes to prevent apathetic or coerced minorities from imposing policies, while severe penalties for fraud deter crimes such as ballot stuffing or eligibility tampering that have plagued modern elections. This framework promotes merit-based governance by ensuring outcomes reflect the informed will of the people, aligning with the Republic’s emphasis on responsibility and preventing the historical pitfalls of rigged systems that favor elites over the competent posterity of European settlers.\n\nFurthermore, by linking the franchise inextricably to citizenship and enforcing accountability, Article 16 fortifies the Republic against future tyrannies amplified by technological advancements that might compromise anonymity and integrity. This forward-looking approach preserves the human experience of democratic freedom, guaranteeing that citizens inherit a meritocratic system where their voice remains paramount in safeguarding liberty for generations."
}