{
  "number": 23,
  "title": "Human Primacy",
  "content": "1.     The purpose of all tools, including artificial intelligence (AI), automation, robotics, and augmented-reality systems, is to serve as leverage for human intelligence, labour, and creativity, never to supplant or degrade them.\n\n2.     No artificial system may ever exercise final sovereign authority over human life, liberty, property, or the governance of the Republic. Decisions to initiate lethal force, to incarcerate, to deprive of citizenship, to declare war, or to alter the Constitution shall remain exclusively in human hands, taken only by natural persons who are citizens of unmixed European descent accountable under this Constitution.\n\n3.     In every domain of public administration, justice, defence, infrastructure operation, and education, critical systems shall be designed and maintained such that fully human teams can immediately assume manual control and continue operations without degradation in the event of AI or automation failure, sabotage, or deliberate shutdown.\n\n4.     All source code, training data, and architectural specifications of any AI system that performs or influences public functions (including but not limited to justice, policing, taxation, electoral systems, infrastructure control, or military targeting) shall be:\n      a)     fully open-source;\n      b)     permanently archived in hard-copy and multiple off-grid physical locations; and\n      c)     comprehensible to competent human engineers without super-human cognitive assistance.\n\n5.     No citizen may be compelled to interact with an AI system as a substitute for human judgment in matters of law, medicine, education, employment evaluation, or personal relations.\n\n6.     Private citizens and enterprises remain free to develop and use AI to any degree they choose, provided it does not violate sections 2–5 above or threaten the demographic continuity provisions of this Constitution.\n\n7.     Every ten years, beginning five years after ratification, the Supreme Court shall convene a Human Primacy Review Tribunal (modelled exactly on the Special Tribunal of Scientific Review in Article 2) to determine whether the combined and cumulative effects of the following are causing measurable, population-wide decline in average citizen intelligence, practical competence, physical fitness (as measured by strength, endurance, and body-composition standards), fertility rates, family formation, or social cohesion:\n      a)     pervasive use of AI and automation;\n      b)     addictive digital media and algorithmic content delivery;\n      c)     sedentary lifestyles enabled by technology;\n      d)     any other technological or cultural development.\n      If the Tribunal finds by majority vote that such decline is occurring and attributable to specific technologies or practices, it shall recommend binding restrictions, up to and including permanent bans, on those technologies or practices within the Republic. The House of the Republic must vote on the recommendations within ninety days; failure to reject them by three-quarters vote renders them law.",
  "precis": "Article 23 affirms human primacy in the Meritocratic Republic of Canada, ensuring that all technologies, especially artificial intelligence and automation, remain tools that amplify rather than replace human capability, reflecting the European tradition of mastering the environment through ingenuity rather than surrendering to it. In an era where digital systems risk supplanting human judgment, leading to widespread atrophy in skills, intelligence, and physical vitality as observed in contemporary dependencies on algorithms for decision-making, this provision mandates that all tools exist solely as leverage for human labor and creativity, securing the freedom of self-determination and preventing the crimes of technological enslavement that could erode the meritocratic ethos. By prohibiting AI from exercising final authority over life, liberty, or governance, reserving such powers for accountable citizens, it counters the perils of autonomous systems that might impose biased or unaccountable rulings, fostering a resilient society where excellence stems from human agency.\n\nCentral to Article 23 is the requirement for manual human control in critical domains such as justice, defense, and infrastructure, with open-source mandates for public AI to ensure transparency and comprehensibility, which addresses historical and emerging threats of black-box technologies that obscure manipulation or foreign sabotage, potentially undermining national sovereignty and demographic continuity. The decennial Human Primacy Review Tribunals, empowered to assess and remedy population-wide declines in competence, fertility, or social bonds caused by pervasive tech like social media or sedentary devices, prevent crimes against posterity such as engineered helplessness or cultural stagnation, promoting positive eugenics through interventions that restore practical skills and family formation. This merit-based oversight deters the subtle tyrannies of addiction algorithms and hyper-sexualized content that have contributed to fertility crises in Western nations, ensuring that European lineages thrive by maintaining robust, unaided human faculties essential for innovation and survival.\n\nFurthermore, by allowing private AI development while enforcing safeguards against threats to core provisions, Article 23 balances freedom with vigilance, fortifying the Republic against future vectors of control like bio-digital convergence or pervasive surveillance that could commodify human experience. This forward-looking framework preserves the European heritage of human-centered progress, where technology enhances rather than replaces the toil and genius that built Canada, guaranteeing that future generations inherit a meritocracy grounded in authentic liberty, resistant to the existential risks of over-technologization that might otherwise lead to a hollow, machine-dependent existence."
}