{
  "number": 20,
  "title": "Fiscal and Monetary Sovereignty",
  "content": "The experience of centuries proves that the private or foreign control of a nation’s money and credit is the most effective and least visible method of conquering a people. Nations that surrender this power are sooner or later dispossessed, impoverished, and replaced. The Meritocratic Republic of Canada shall never repeat that fatal error.\n\n1.     The Bank of Canada is hereby affirmed as a 100 % publicly owned institution reporting directly to the House of the Republic. Its sole mandate is the preservation of the purchasing power of the currency, full employment of Canadian citizens, and the financing of legitimate public infrastructure and defence at zero or near-zero interest. All profits of the Bank of Canada belong exclusively to the Canadian people and shall be paid annually into general revenue or the sovereign wealth fund created under Article 22.\n\n2.     The creation and issuance of the nation’s money in all forms (physical cash, digital entries, and credit) is the sole and permanent prerogative of the sovereign Canadian people acting through their own state-owned central bank, the Bank of Canada. No private or foreign entity may ever create Canadian money as interest-bearing debt.\n\n3.     The monetary unit of the Republic shall be defined as a fixed weight of gold (or silver, platinum, or palladium at the holder’s option) established by the Constituent Assembly. All banknotes and digital credits issued by the Treasury shall be redeemable on demand in that weight of metal, and no law may suspend or diminish this convertibility except by unanimous vote of the House during declared enemy invasion and for no longer than one year.\n\n4.     All new money required for the legitimate needs of the nation shall be issued debt-free by the Bank of Canada on the authority of Parliament. No Canadian government shall ever again borrow money at interest from private banks, foreign governments, or supranational institutions.\n\n5.     No central-bank digital currency, programmable money, social-credit system, or any form of currency that can restrict, track, or condition individual spending shall ever be created, tested, piloted, or tolerated within the Republic under any pretext whatsoever. Violation is high treason.\n\n6.     Private issuers may create bearer digital cash instruments that are fully anonymous, non-programmable, and interoperable with the Bank of Canada’s settlement system. Such instruments shall be legal tender alongside physical cash and Bank-issued fiat. Private issuers of such instruments shall certify annually that their systems preserve complete anonymity and impose no restrictions on use.\n\n7.     Total taxation at all levels of government combined shall never exceed fifteen percent of gross domestic product without explicit approval by binding national referendum. Public debt shall never exceed thirty percent of gross domestic product without the same referendum requirement.\n\n8.     Usury against the nation—lending money to the government or public entities at interest, or manipulating monetary policy for private gain—is a capital offence punishable by death.",
  "precis": "Article 20 reclaims full fiscal and monetary sovereignty for the Meritocratic Republic of Canada, drawing upon centuries of hard-won lessons against usury and financial predation that have toppled empires and impoverished peoples throughout history. By reclaiming the Bank of Canada as a fully public institution and mandating debt-free money creation, this provision ensures that the nation’s currency serves the common good rather than enriching private bankers or foreign entities, securing the freedom of economic self-determination for the European-descended citizenry who built Canada’s prosperity through ingenuity and labor. It prevents the crimes of inflationary theft and debt servitude that erode wages, savings, and generational wealth, as evidenced by modern debasements where central banks have ballooned money supplies to fund endless deficits, leading to housing unaffordability and demographic displacement. In an era of digital finance and algorithmic trading, these safeguards foster meritocratic growth by channeling resources toward productive infrastructure and full employment, unburdened by interest-bearing loans that siphon productivity away from competent citizens.\n\nCentral to Article 20 is the prohibition of central-bank digital currencies and programmable money, classified as high treason, which counters the dystopian threats of total surveillance and behavioral control that could condition spending or punish dissent, undermining the human experience of liberty. The fixed metallic standard for the currency, redeemable in gold or equivalents, anchors value against fiat volatility, while strict limits on taxation at 15 percent of GDP and debt at 30 percent without referendum approval prevent the crimes of fiscal overreach and generational plunder that have bankrupted nations under the guise of progress. Accountability measures, including capital punishment for usury against the nation and transparent audits, deter corruption among officials, ensuring that only those of unimpeachable merit steward the monetary system, thus protecting the cultural continuity of European lineages from economic manipulations that facilitate replacement or subjugation.\n\nMoreover, by barring entanglements with supranational banking cartels and allowing anonymous private digital cash without restrictions, Article 20 fortifies the Republic against future perils amplified by AI-driven economies or global agendas that seek to centralize control over transactions. This merit-based framework preserves the freedoms of privacy, innovation, and prosperity for posterity, defending against technological advancements like tokenized assets that could otherwise enable unprecedented financial tyranny, guaranteeing that Canada’s European heritage endures through sovereign, human-centered wealth creation rather than algorithmic enslavement."
}