{
  "number": 14,
  "title": "Public Service",
  "content": "1.     Every person assuming public office whether elected, appointed, commissioned, or employed in the civil service, judiciary, military, or any agency of the Republic, shall swear or affirm a solemn oath of allegiance exclusively to this Constitution and to the people of the Meritocratic Republic of Canada.\n    a)     The oath shall be in the following form, or a substantially identical variant approved by the Supreme Court:\n“I, [name], do solemnly swear (or affirm) that I will faithfully uphold and defend the Constitution of the Meritocratic Republic of Canada and serve the people of the Republic to the best of my ability, without fear, favour, or personal ambition, and that I will bear true allegiance to no other authority, person, or entity.”\n    b)     No oath or pledge of allegiance may be required to parliament, the prime minister, any political party, foreign power, supranational body, or other institution. Any existing statutory oath incompatible with this provision is abrogated upon ratification.\n    c)     The oath shall be administered publicly and recorded. Refusal to take the oath disqualifies the individual from office. Violation of the oath constitutes a crime against the Constitution.\n\n2.     No elected official, minister, or civil servant above the rank of director may receive annual compensation from public funds exceeding twice the median wage of the Canadian people.\n\n3.     Judges of the superior courts and the Supreme Court of the Republic shall receive compensation fixed at five times the median wage, adjusted annually, so that the most able citizens may be drawn to the bench without personal sacrifice.\n\n4.     Every candidate for or holder of public office or judicial appointment must, upon nomination and annually thereafter, make full public disclosure of all personal and family financial holdings, debts, and sources of income.\n\n5.     No person may be appointed or elected to public office or the judiciary who has ever been convicted of any criminal offence involving moral turpitude, sexual offence, fraud, embezzlement, perjury, or treason. Discovery of any such conviction or of undisclosed offences after appointment shall result in immediate removal and permanent disqualification from any public office or judicial appointment.\n\n6.     Any public servant, corporate officer acting under colour of law, or judge found guilty of corruption, gross negligence, waste of public funds, insider trading, financial fraud, collusion to offshore Canadian jobs, or the awarding of contracts or employment on the basis of factors other than merit shall be:\n    a)     permanently disqualified from all public office and trust,\n    b)     imprisoned for not less than ten years, and\n    c)     personally liable to repay three times the amount lost or wasted.\n\n7.     The penalty for proven treason or deliberate subversion of the demographic continuity provisions of Articles 8 and 9 is death by firing squad, to be carried out seven days after final lawful determination.\n\n8.     Sexual offences against minors or any non-consensual sexual crime committed by a public servant, past or present, shall be punished by mandatory life imprisonment without parole and permanent public registration as a sexual offender, in addition to automatic removal and disqualification.\n\n9.     Any accusation of sexual offence, corruption, or other disqualifying crime made against a sitting or prospective public servant shall be investigated swiftly and publicly by a special tribunal of three senior judges chosen by lot.\n    a)     If the accusation is proven false and brought in malice or for political advantage, the accuser shall suffer the exact penalty that would have applied to the accused had the accusation been true (imprisonment, financial restitution, or public registration as appropriate), plus permanent disqualification from any future public accusation or testimony against another citizen.\n    b)     Anonymous or unsworn accusations shall be dismissed out of hand and may subject the source, if discovered, to the same penalties.\n    c)     Until conviction by unanimous jury verdict beyond reasonable doubt, the accused retains all office, salary, and presumption of innocence; no suspension, gag order, or media blackout may be imposed.\n\n10.  Any elected or appointed official who knowingly makes a false statement of material fact to the public or the House concerning policy, qualifications, past conduct, or the state of the nation, with intent to deceive the electors or induce legislative action, commits the offence of Public Deception, punishable by immediate removal from office, permanent disqualification from public trust, and imprisonment for not less than five years.",
  "precis": "Article 14 establishes unbreakable safeguards for public service in the Meritocratic Republic of Canada, ensuring that all who exercise authority whether elected, appointed, judicial, or commissioned, owe exclusive allegiance to the Constitution and the people, sworn publicly in a solemn oath that rejects any pledge to parliament, prime minister, party, or external power. This foundational requirement, abrogating all incompatible prior oaths upon ratification, anchors governance in popular sovereignty and immutable principle, preventing institutional capture or personalist loyalty that undermined past systems.\n\nCompensation for senior officials is capped at twice the median wage to attract competent servants without creating a privileged class, while superior court judges receive five times the median to draw the ablest citizens to the bench. Full annual financial disclosure exposes conflicts, and permanent disqualification bars those convicted of moral turpitude, fraud, sexual offences, or treason from any public trust. Corruption, waste, nepotism, or offshoring jobs incurs severe penalties: lifelong ban, minimum ten-year imprisonment, and treble restitution. Treason against demographic continuity provisions carries death, reinforcing the Republic’s existential commitment to its founding European peoples.\n\nAccusations of disqualifying crimes trigger swift, public investigation by lot-selected senior judges, with malicious false claims punished identically to the alleged offence, deterring weaponised smears while preserving presumption of innocence. Public deception by officials, knowing material falsehoods to electors or legislature, entails immediate removal, permanent disqualification, and minimum five-year imprisonment.\n\nThis Article secures a public service of unassailable integrity and merit, immune to elite extraction, ideological subversion, or future threats from digital manipulation and supranational agendas, guaranteeing that power remains the faithful servant of the people and their posterity under constitutional rule."
}