{
  "number": 31,
  "title": "Abrogation and the Eternal Right of the People",
  "content": "1.     Upon the ratification of this Constitution, all statutes, regulations, orders-in-council, judicial precedents, international treaties, conventions, agreements, compacts, and obligations entered into by or in the name of Canada, the Dominion of Canada, or any predecessor entity that are incompatible with the letter or spirit of this Constitution are declared null and void ab initio and of no legal force or effect. No court, official, or international body may recognise or enforce any such abrogated law or obligation.\n\n2.     Within five years of ratification, the House of the Republic shall enact a Schedule of Retained Statutes listing those pre-existing laws deemed fully compatible with this Constitution. Any law not included in that Schedule shall lapse automatically and permanently at the end of the fifth year.\n\n3.     The provisions of this section are part of the unamendable core of this Constitution and may only be altered by the procedure set forth in Article 30 for the unamendable provisions.\n\n4.     Transitional Population of National Registries\n      a)     Within ninety days of ratification, the Supreme Court shall appoint the Registrar of Constitutional Registries per Article 2, section 4d. Upon appointment, the Registrar shall immediately commence the process of populating the National Registry of Citizens and the National Registry of Qualified Experts, utilizing subordinate staff and, if deemed necessary, forming ad-hoc transitional teams composed of qualified citizens (of unmixed European descent) with expertise in genealogy, data verification, and administration. The Registrar shall collaborate with domestic accredited institutions to cross-verify existing records while maintaining strict confidentiality and security protocols.\n      b)     Existing civil registries, ecclesiastical records, and verified citizenship documents shall serve as the primary sources for initial population of the registries. Where gaps exist, provisional entries may be made pending full verification under Article 9 criteria.\n      c)     The transitional process shall be completed within three years of ratification, after which all provisional entries must be fully verified or removed. No new citizenship may be granted during this period except by direct order of the Supreme Court in extraordinary cases.\n\n5.     The people of the Meritocratic Republic of Canada, conscious of the fragility of all human institutions and the eternal vigilance required to preserve liberty, hereby charge their posterity with the sacred duty to defend this Constitution by any means necessary against internal corruption or external assault. Future generations are forewarned that the ratification of this Constitution may provoke economic, informational, kinetic, or demographic attacks upon the nation and its people. The eternal right of the people to alter or abolish any government that becomes destructive of the ends of liberty is reaffirmed without limit or qualification.",
  "precis": "Article 31 provides for the clean abrogation of all pre-existing laws, treaties, and obligations incompatible with the new Constitution, ensuring a fresh foundation unburdened by the accumulated contradictions and foreign entanglements of the past. By declaring such instruments null ab initio and requiring a deliberate Schedule of Retained Statutes within five years, it secures the freedom of renewal, preventing the crimes of legal inertia that perpetuate obsolete or subversive policies, particularly those facilitating demographic replacement or supranational control. This meritocratic reset aligns with the European tradition of revolutionary renewal when institutions decay, allowing competent citizens to rebuild governance on principles of excellence and continuity rather than inherited dysfunction, thus protecting posterity from the inertial tyrannies of entrenched regulations or genocidal demographic policies, fostering a streamlined legal system that prioritizes competence and European cultural continuity.\n\nThis article also safeguards against stagnation by reserving the people’s unalienable right to refound the Constitution through deliberate processes, reflecting the meritocratic principle that governance must evolve with technological and existential challenges without hasty disruption. It prevents crimes such as elite capture or external attacks during transition by forewarning of potential assaults (economic, informational, or kinetic) and charging future generations to defend the framework by any means, aligning with the Charter’s emphasis on positive eugenics and family sovereignty to ensure the founding peoples’ legacy endures. The unamendable status of this section reinforces its role as a bulwark, thwarting attempts to entrench power structures that stifle inquiry or economic liberty, thereby enhancing the human experience of freedom in a future where artificial intelligence and warfare could otherwise exploit rigid or obsolete systems.\n\nArticle 31 fortifies the Republic’s adaptability while anchoring it in eternal principles, shielding citizens from the perils of legal chaos or revolutionary excess that have plagued nations amid rapid progress. It prevents the crime of perpetual subjugation by empowering merit-driven renewal, ensuring that the European-descended people’s dominion over their homeland remains secure against internal decay or external threats. In doing so, it upholds a constitution designed not as an end but as a living instrument for prosperity, where freedom is defended vigilantly for generations to come."
}