{
  "number": 3,
  "title": "Right to Keep and Bear Arms and Self-Defence",
  "content": "The full and unqualified rights enumerated in this Article are vested exclusively in citizens as defined in Article 9.\n\n1.     Every citizen, upon reaching the ages and completing the minimal safety courses herein specified, shall enjoy the inviolable and unrestricted right to acquire, possess, carry (see section 6), and train with personal arms suitable for individual and common defence.\n\n2.     The relevant permits described in this Article are granted automatically, without further application or fee, to every citizen who meets the age and relevant training requirements below.\n\n3.     Permanent residents and other non-citizens may possess firearms for hunting, sport shooting, or property defence only under a separate, regulated provincial licensing regime that may include additional training, storage, and background requirements. The carrying of loaded firearms in public by non-citizens remains prohibited.\n\n4.     Every citizen who has reached the age of eighteen or older, upon successful completion of the Canadian Firearms Safety Course, shall be issued a non-expiring permit to acquire, possess, and use non-restricted long guns.\n\n5.     Nothing in this Article shall prevent the provinces from issuing restricted, revocable minor’s hunting permits to citizens aged twelve and older for the sole purpose of lawful hunting or predator control during declared hunting seasons, subject to:\n      a)     parental consent or successful completion of a provincial youth hunter-education programme; and\n      b)     a prohibition on carry outside designated hunting areas or outside hunting season. Such provincial minor’s permits confer no general right of possession or carry and expire automatically at age eighteen, at which point the holder immediately qualifies for the permit under section 4.\n\n6.     Every citizen aged twenty-one or older, upon successful completion of the Canadian Restricted Firearms Safety Course, shall be issued a non-expiring permit to acquire, possess, and use restricted firearms, including pistols and AR/AK-pattern rifles or other hand-held arms which may be developed. Renewal every five years shall require only updated photographic identification. Failure to renew shall not constitute loss of the right to possess, only to carry outside the home. Holders of the restricted permit shall have the unqualified right to carry a concealed loaded pistol with one spare magazine with ammunition, except in locations where discharge could endanger multiple persons or property beyond the direct path of the projectile (e.g., aircraft, fuel storage facilities).\n\n7.     The Canadian firearms safety courses listed in this Article shall not be made artificially restrictive or difficult to pass by the average citizen.\n\n8.     Permit holders have the unqualified right to transport the arms to which their permit applies.\n\n9.     All non-permitted citizens, residents, and visitors, including minors, may use firearms under the direct supervision and with the consent of a relevant permit holder.\n\n10.    Every citizen aged fourteen or older may carry and use chemical irritant sprays for self-defence.\n\n11.    The use of lethal force in defence of life, bodily integrity, or lawfully occupied property is presumptively lawful when the citizen reasonably believes it necessary to prevent imminent death, serious bodily harm including that of rape, or the felonious invasion of a dwelling, vehicle, or place of business. No citizen shall ever have a duty to retreat from any place he or she has a legal right to be. The burden of proof in any prosecution rests upon the state to disprove the reasonableness of the defender’s belief beyond a reasonable doubt.\n      Provided, however, that any citizen proven in a court of law to have negligently caused death or serious injury through the use of a firearm, outside the reasonable bounds of lawful self-defence, shall be liable to severe penalty, including imprisonment for a term of not less than ten years, forfeiture of arms privileges for life, and civil restitution to victims or their families as determined by the court. Such negligence shall be established only upon proof beyond a reasonable doubt that the citizen’s actions demonstrated reckless disregard for human life inconsistent with the responsible exercise of the rights herein affirmed.\n\n12.    Protections Against Vexatious or Malicious Prosecution\n      a)     No citizen shall be arrested or charged with any offence arising from the use of force in circumstances presumptively lawful under section 11 unless a judicial officer, upon review of sworn evidence, finds probable cause that the force was unreasonable.\n      b)     In any prosecution under this Article, if the citizen is acquitted, the charges are dismissed on the merits, or no-billed by a grand jury (where applicable), the citizen shall be entitled to full recovery from the State of all legal costs, reasonable attorney fees, and compensation for lost wages or other demonstrable hardship.\n      c)     If a court of competent jurisdiction determines that charges were brought vexatiously, maliciously, or without probable cause, the responsible officials or prosecutors shall be personally liable for treble damages to the citizen, subject to removal from office, permanent disqualification from public service, and potential criminal prosecution for abuse of process or deprivation of rights under colour of law.",
  "precis": "In a world where technological disparities and demographic shifts can empower aggressors while disarming the competent, Article 3 enshrines the right to keep and bear arms as an indispensable pillar of the Meritocratic Republic of Canada, ensuring that citizens retain the means to defend their lives, families, and heritage against threats both personal and existential. This provision recognizes that true meritocracy demands not only intellectual and economic excellence but also the physical capacity for self-reliance, drawing from the European traditions of armed freemen in medieval assemblies and Enlightenment ideals of natural rights that viewed armament as essential to liberty. By granting automatic, non-expiring permits for non-restricted and restricted firearms upon minimal safety training, it secures the freedom of individual and collective defense, preventing crimes like the unchecked invasions or assaults that have plagued disarmed populations historically, such as the vulnerability of European settlers to wilderness perils or modern instances of state-sponsored disarmament leading to tyranny. In contemporary settings, where surveillance states and mass migrations introduce new vectors of instability, this Article protects the human experience of freedom by empowering meritorious citizens to safeguard their posterity, countering the erosion of sovereignty through personal empowerment rather than reliance on potentially incompetent or captured institutions.\n\nThe structured progression of rights, from youth hunting permits to full concealed carry for adults, aligns with meritocratic principles by tying access to demonstrated competence via straightforward safety courses, while restricting non-citizens to limited uses under provincial oversight, thereby preserving demographic continuity and high-trust societal norms inherited from European founders. This framework prevents abuses such as arbitrary denials or burdensome regulations that have historically disarmed law-abiding citizens, ensuring that permits are granted without fees or undue hurdles and that transport and supervised use remain unqualified. By presuming the lawfulness of lethal force in defense of life, integrity, or property without a duty to retreat, it shifts the burden to the state in prosecutions, deterring crimes like home invasions or felonious assaults that exploit vulnerability, and fostering a culture where merit is rewarded through responsible stewardship of power. This modern adaptation honors the European legacy of resilient communities, incorporating safeguards against misuse while promoting training that builds communal defense capabilities, thus shielding the Republic from the perils of twenty-first-century threats like organized crime or ideological subversion.\n\nCentral to Article 3 is an unshakeable trust in the citizenry’s ability to wield arms responsibly, for if the people cannot be entrusted with the tools of their own protection, then the essence of self-governance and human dignity dissolves. History warns that disarmament paths lead inexorably to oppression, as seen in regimes that equated armed citizens to threats. No authority can be safely empowered to strip this right, for it would invite endless encroachments where self-defense is reframed as vigilantism; thus, the right to bear arms must remain sacrosanct, rooted in faith that a competent populace will uphold order through vigilant merit, just as with speech and inquiry. Furthermore, the Article offers robust protections for defenders, presuming reasonableness in force and placing the onus on the state to disprove it beyond doubt, shielding individuals from ruinous prosecutions for good-faith actions while limiting non-citizens’ access to prevent systemic risks, paving the way for a meritocratic future where freedom is actively defended, preserving the nation’s character against forces that seek its dilution."
}