{
  "number": 14,
  "title": "Public Service",
  "content": "1.     No elected official, minister, or civil servant above the rank of director may receive annual compensation from public funds exceeding twice the median wage of the Canadian people.\n\n2.     Judges of the superior courts and the Supreme Court of the Republic shall receive compensation fixed at five times the median wage, adjusted annually, so that the most able citizens may be drawn to the bench without personal sacrifice.\n\n3.     Every candidate for or holder of public office or judicial appointment must, upon nomination and annually thereafter, make full public disclosure of all personal and family financial holdings, debts, and sources of income.\n\n4.     No person may be appointed or elected to public office or the judiciary who has ever been convicted of any criminal offence involving moral turpitude, sexual offence, fraud, embezzlement, perjury, or treason. Discovery of any such conviction or of undisclosed offences after appointment shall result in immediate removal and permanent disqualification.\n\n5.     Any public servant, corporate officer acting under colour of law, or judge found guilty of corruption, gross negligence, waste of public funds, insider trading, financial fraud, collusion to offshore Canadian jobs, or the awarding of contracts or employment on the basis of factors other than merit shall be:\n      a)     permanently disqualified from all public office and trust,\n      b)     imprisoned for not less than ten years, and\n      c)     personally liable to repay three times the amount lost or wasted.\n\n6.     The penalty for proven treason or deliberate subversion of the demographic continuity provisions of Articles 8 and 9 is death by firing squad, to be carried out seven days after final lawful determination.\n\n7.     Sexual offences against minors or any non-consensual sexual crime committed by a public servant, past or present, shall be punished by mandatory life imprisonment without parole and permanent public registration as a sexual offender, in addition to automatic removal and disqualification.\n\n8.     Any accusation of sexual offence, corruption, or other disqualifying crime made against a sitting or prospective public servant shall be investigated swiftly and publicly by a special tribunal of three senior judges chosen by lot.\n      a)     If the accusation is proven false and brought in malice or for political advantage, the accuser shall suffer the exact penalty that would have applied to the accused had the accusation been true (imprisonment, financial restitution, or public registration as appropriate), plus permanent disqualification from any future public accusation or testimony against another citizen.\n      b)     Anonymous or unsworn accusations shall be dismissed out of hand and may subject the source, if discovered, to the same penalties.\n      c)     Until conviction by unanimous jury verdict beyond reasonable doubt, the accused retains all office, salary, and presumption of innocence; no suspension, gag order, or media blackout may be imposed.\n\n9.     Any elected or appointed official who knowingly makes a false statement of material fact to the public or the House concerning policy, qualifications, past conduct, or the state of the nation, with intent to deceive the electors or induce legislative action, commits the offence of Public Deception, punishable by immediate removal from office, permanent disqualification from public trust, and imprisonment for not less than five years.",
  "precis": "Article 14 fortifies the Meritocratic Republic of Canada by imposing rigorous standards on public service, ensuring that governance attracts individuals of exceptional ability and integrity while deterring those motivated by personal gain or malice, a principle deeply rooted in the European traditions of accountable leadership that built enduring societies. In an age where bureaucratic bloat and elite capture have eroded public trust, this Article caps compensation for officials at twice the median wage, drawing competent servants without fostering a detached ruling class, and mandates full financial transparency to expose conflicts of interest. By permanently barring those convicted of moral turpitude or serious crimes from office, it safeguards the freedom of citizens to be governed by exemplary figures, preventing the infiltration of corrupt elements that have historically led to societal decay and the betrayal of the founding European posterity’s legacy.\n\nCentral to Article 14 is the enforcement of merit through severe penalties for misconduct, such as imprisonment and treble restitution for corruption, waste, or favoritism, which counters the crimes of nepotism, fraud, and subversion that undermine meritocratic excellence. The death penalty for treason against demographic continuity provisions reinforces the inviolable commitment to preserving the European character of the nation, addressing modern perils like ideological infiltration or globalist agendas that seek to dilute cultural integrity. Swift, public tribunals for accusations ensure justice without weaponized smears, with false claims punished mirror-like to deter political sabotage, promoting a government where truth and competence prevail over deception and division, thus securing the human experience of fair representation for all citizens.\n\nFurthermore, by criminalizing public deception with removal and imprisonment, Article 14 protects against future threats amplified by AI-generated misinformation or digital manipulation, ensuring that leaders remain servants accountable to the people rather than manipulators of reality. This framework upholds the freedoms of transparency and ethical governance for generations, resilient amid technological advancements like surveillance states or programmable economies, allowing the European-descended meritocracy to thrive without the shadows of past tyrannies or emerging vectors of control."
}