{
  "number": 24,
  "title": "Property Rights and Economic Liberty",
  "content": "The right of private property is the foundation of a free, meritocratic, and family-centred society. Without it, no man can be secure in the fruits of his labour, no family can build intergenerational wealth, and no nation can remain independent. The Republic therefore erects the following unbreakable protections:\n\n1.     Every citizen’s lawfully acquired real, personal, intellectual, and financial property is inviolable. No government, agency, court, or private entity acting under colour of law may seize, freeze, encumber, diminish, or destroy such property except by due process of law for a public use explicitly authorised by a two-thirds vote of the House of the Republic and upon prior payment of full, fair, and immediate cash compensation at a price mutually agreed or determined by a jury of twelve property-owning citizens.\n\n2.     No tax, fee, regulation, zoning ordinance, environmental designation, heritage designation, or civil-forfeiture proceeding may be used to deprive an owner of all or substantially all economic use of his property without full compensation as defined in section 1. Any official who attempts such a taking commits a felony punishable by a mandatory minimum of seven years’ imprisonment and permanent disqualification from public office.\n\n3.     Upon ratification, all remaining “Crown lands” are renamed and reclassified as the National Domain of the Republic. They are held in perpetual trust for the exclusive benefit of the citizens of the Republic and their posterity as defined in Article 9. No international body, foreign government, non-citizen, or corporation more than ten percent foreign-owned may ever own, lease, or exercise control over any part of the National Domain.\n\n4.     Any citizen of unmixed European descent aged twenty-one or older, of good character, and willing to occupy and improve the land personally, may stake a homestead claim of up to 160 acres (64 hectares) of unoccupied, unpatented land in the National Domain north of the 55th parallel or in designated frontier zones. After five continuous years of residence and visible improvement (dwelling, fencing, clearing, or productive agriculture), full fee-simple title shall issue free of charge. Homestead land may never be sold or transferred to non-citizens or to any corporation. It descends to lineal heirs or reverts to the National Domain. Provinces may establish parallel homesteading programmes on provincial public land under the same terms.\n\n5.     No law or regulation may discriminate against family-owned farms, ranches, fishing boats, or businesses with fewer than 100 employees. Inheritance of family farms, family homes, and family businesses by lineal descendants shall be permanently exempt from estate, inheritance, capital-gains, or any other transfer taxation.\n\n6.     No corporation, trust, or combination may control more than fifteen percent of any national market for food, energy, shelter, transportation, or communications without explicit authorisation by national referendum. Predatory pricing, exclusive dealing, or collusion designed to destroy family or small enterprises is punishable by immediate dissolution of the offending corporation and treble damages payable to victims. Corporate charters are revocable at any time by a simple majority vote of the House of the Republic for repeated violation of this Article.\n\n7.     Every citizen has the unqualified right to repair, modify, upgrade, or resell any physical object he lawfully owns. No manufacturer may use law, software locks, patents, or end-user agreements to prevent this right.\n\n8.     All government-funded or government-mandated software, communication protocols, and data formats shall be fully open-source and royalty-free in perpetuity. No citizen or enterprise may be compelled to use proprietary, closed-source systems for any interaction with the state or for participation in the economy.\n\n9.     Interest rates on secured loans for family homes or family farms may never exceed four percent simple interest per annum. Violation is a felony. Predatory lending, payday loans, and revolving consumer debt at rates above ten percent simple interest are permanently banned.\n\n10.    Eminent domain may be exercised only for physical public infrastructure (roads, railways, power lines, pipelines, military bases, or flood-control works). It may never be used for private development, “blight” removal, tax-revenue enhancement, or transfer to another private party.\n\n11.    The sale of a citizen’s principal private residence or family farm shall be permanently exempt from capital-gains taxation of any kind.",
  "precis": "Article 24 establishes property rights and economic liberty as the bedrock of prosperity in the Meritocratic Republic of Canada, honoring the European settlers’ legacy of self-reliant toil that transformed untamed lands into enduring wealth for their posterity. In an age where regulatory overreach and corporate monopolies have eroded individual autonomy, this provision declares private property inviolable, ensuring that citizens can securely build intergenerational legacies without fear of arbitrary seizures or devaluations that have historically disenfranchised competent producers. By mandating full compensation for any public takings and restricting eminent domain to essential infrastructure, it secures the freedom to own, improve, and pass on assets, preventing the crimes of stealth expropriation through zoning, taxation, or environmental pretexts that undermine meritocratic achievement and family continuity.\n\nCentral to Article 24 is the reclamation of national lands as the National Domain, held in trust for citizens and offering homestead opportunities to those of proven character who commit to land development, which counters the modern perils of foreign ownership and land consolidation that have displaced native populations elsewhere. Protections against predatory lending, market monopolies, and corporate charters revocable for anti-competitive behavior deter crimes like collusion, price gouging, and usurious debt that trap families in cycles of poverty, promoting instead economic liberty through open-source mandates, repair rights, and tax exemptions for family inheritances. These measures ensure merit-based competition flourishes, shielding small enterprises and family farms from bureaucratic favoritism or globalist agendas that prioritize profit over people, thus preserving the European ethos of independent stewardship that built Canada’s resource wealth.\n\nFurthermore, by limiting interest rates and banning practices that commodify essentials like food and energy, Article 24 fortifies the Republic against future threats from digital economies, AI-driven monopolies, or blockchain-based asset manipulations that could centralize control and erode human agency. This stance upholds the human experience of freedom in property ownership, resilient amid technological convergences like smart contracts or geo-fencing that might otherwise enable unprecedented encroachments, guaranteeing that European posterity inherits a meritocracy where economic sovereignty empowers innovation and safeguards against the vectors of modern tyranny."
}