{
  "number": 30,
  "title": "Amendment and Revision of Articles and Provisions",
  "content": "The Charter of Rights and Freedoms, the Declaration’s assertion that this nation was founded by European settlers and is forever reserved to their posterity, and all Articles or provisions that directly secure the European identity, biological continuity, merit principle, family sovereignty, absolute freedom of speech and inquiry, demographic threshold, and permanence of the founding peoples are supreme, eternal, and unamendable except by the unanimous consent of all provincial legislatures followed by a national referendum obtaining a three-quarters majority of votes cast with a minimum 70 % turnout.\n\nAll other Articles of this Constitution may be amended, added to, or clarified according to the following procedure:\n\n1.     Any proposed amendment must be introduced in the House of the Republic by at least twenty percent of its members or by a petition signed by five percent of registered citizens.\n\n2.     The proposed amendment must be published in full and debated publicly for no fewer than ninety days.\n\n3.     The House of the Republic must approve the proposed amendment by a two-thirds majority in two separate readings separated by at least six months.\n\n4.     Within twelve months of final passage by the House, the amendment must be ratified by referenda in at least seven of the ten provinces, obtaining a simple majority (50 % + 1) of votes cast in each of those seven provinces and representing at least two-thirds of the total national population.\n\n5.     Alternatively, if the House so chooses at the outset, the amendment may be submitted directly to a single national referendum requiring a three-fifths (60 %) majority of votes cast with a minimum turnout of 60 % of registered citizens.\n\n6.     No amendment may be considered or voted upon more than once in any five-year period. No amendment may directly or indirectly weaken, diminish, or circumvent the unamendable provisions enumerated in the preamble to this Article. Any attempt to propose or enact such an amendment constitutes high treason.\n\n7.     In the extraordinary event that the people determine the existing Constitution has become irredeemably corrupted or inadequate, a complete refoundation convention may be called by a petition of fifteen percent of registered citizens followed by a national referendum obtaining a three-quarters majority with minimum 75 % turnout. Such a convention shall draft a new constitution subject to final ratification by a three-quarters majority in a subsequent referendum with the same turnout threshold.",
  "precis": "Article 30 establishes rigorous yet balanced procedures for constitutional amendment in the Meritocratic Republic of Canada, distinguishing eternal, unamendable core provisions that safeguard European identity, biological continuity, meritocracy, family sovereignty, speech, inquiry, and demographic thresholds from secondary articles open to measured evolution. This provision is essential because it prevents both ossification and reckless change, ensuring the Constitution remains a living instrument adapted to unforeseen challenges while eternally shielding the founding principles from erosion. By requiring extraordinary consensus for core alterations—unanimous provincial assent plus a three-quarters national referendum with high turnout—it secures the freedom of perpetual self-determination for the European-descended posterity, thwarting crimes like gradual subversion through repeated minor amendments that could cumulatively dissolve the nation’s character, as observed in other jurisdictions where incremental reforms facilitated demographic replacement or ideological capture. This meritocratic safeguard honors the deliberate wisdom of the founders, classifying subversive efforts as treason to maintain the nation’s sovereign integrity.\n\nThis article also fortifies the Republic against the pitfalls of rigidity or fragility by allowing clarifications and additions to secondary articles via democratic thresholds, such as two-thirds House approval and referenda, which honor the European heritage of deliberative assemblies while embedding safeguards like cooldown periods to thwart repetitive or frivolous proposals. It secures freedoms by empowering citizens to initiate amendments through petitions, fostering active meritocratic engagement without enabling mob rule or external influences that could erode family sovereignty, free speech, or inquiry. The prohibition on amendments that indirectly weaken unamendable elements prevents crimes like demographic engineering or the erosion of biological continuity, ensuring that the Constitution evolves only in ways that enhance, rather than endanger, the founding peoples’ legacy. Moreover, the extraordinary refoundation clause reserves ultimate sovereignty to the people, allowing a complete overhaul only through overwhelming consensus, thus countering modern threats like supranational interference that might seek to dissolve national identities.\n\nArticle 30 enhances the human experience of freedom by creating a living yet fortified Constitution that adapts to innovation while preserving the merit-driven society carved by European settlers, shielding future generations from the tyrannies of unstable governance or imposed changes that have destabilized nations in the digital age. It prevents genocidal acts through constitutional dilution by upholding the eternal primacy of European posterity, aligning with positive eugenics and cultural preservation to ensure the Republic remains a bastion of rational, self-determined progress. In doing so, it promotes a framework where liberty is not static but resilient, allowing competent lineages to flourish under laws that evolve thoughtfully for the common good."
}