{
  "number": 22,
  "title": "Infrastructure, Energy, and National Development",
  "content": "1.     The State shall pursue and maintain world-class physical and digital infrastructure of a standard equal to or superior to the foremost nations, including but not limited to ultra-high-speed rail, advanced nuclear power (fission and future fusion), expanded hydrocarbon production and refining, regenerative agriculture, northern all-weather transportation corridors, and next-generation telecommunications.\n\n2.     Resource extraction and sale shall benefit the Canadian people directly through a sovereign wealth fund. No resource royalties or profits may be diverted to foreign entities or supranational organisations.\n\n3.     The Republic shall pursue the systematic restoration of domestic manufacturing capacity lost through prior supranational trade agreements and offshoring.\n    a)     Critical industries essential to national sovereignty, citizen employment, and supply-chain resilience shall receive targeted state support, including protective tariffs, preferential public procurement, and investment from the sovereign wealth fund.\n    b)     No trade agreement may be entered that subordinates domestic industrial policy to foreign or supranational jurisdiction. Existing agreements incompatible with this provision shall be abrogated within two years of ratification.\n    c)     Priority shall be given to industries providing stable, high-skill employment for citizens, with national preference strictly applied.\n\n4.     Drinking water\n    a)     Every municipality and public water utility shall deliver potable water that meets or exceeds the highest international biological and chemical purity standards.\n    b)     Water shall be continuously monitored and publicly reported upon by three independent testing laboratories chosen annually by lot from a national registry of accredited facilities. Results shall be posted online in real time and archived permanently.\n    c)     No substance, pharmaceutical (including hormonal contraceptives), fluoride, psychotropic compound, nano-material, or any other additive, may be introduced into public drinking water except for the minimum disinfectants strictly necessary for microbiological safety and only with explicit, recorded legislative approval renewable every five years.\n    d)     All systems capable of removing estrogens, pharmaceutical residues, PFAS, heavy metals, and industrial contaminants shall be deployed as technology and finance permit. Failure to upgrade within reasonable time after proven technology becomes available shall be punishable as criminal negligence by the responsible officials.\n\n5.     Waste-water and industrial effluent\n    a)     All municipal and industrial waste-water treatment facilities shall employ best-available technology to remove biological pathogens, pharmaceutical residues, heavy metals, and persistent organic pollutants before discharge into rivers, lakes, aquifers, or the sea.\n    b)     Treated water returned to the environment must meet or exceed the purity of the receiving body upstream of the discharge point.\n    c)     Resource-extraction water use (including hydraulic fracturing and oil-sands processing) is permitted provided closed-loop systems or equivalent technologies are used wherever feasible and no irreversible contamination of freshwater aquifers occurs. Violations shall incur immediate shutdown and personal liability of corporate officers.\n\n6.     Transportation and future mobility The State and private enterprise shall be free to develop, test, and deploy all forms of transportation including human-driven, robotic, autonomous, electric, hydrogen, maglev, hyperloop, aerial drone, or any future modality, subject only to objective safety and emissions standards that do not discriminate against any technology or fuel source capable of meeting them. No citizen may be compelled to use autonomous systems against their will; manual control of personally owned vehicles shall remain an inviolable right.\n\n7.     Resource revenues from the sovereign wealth fund may be used to accelerate the infrastructure objectives in this Article, with priority given to projects that directly enhance national independence, demographic vitality, and family formation (e.g., northern homestead enabling infrastructure, fertility-preserving environmental quality, and high-wage industrial corridors).\n\n8.     All infrastructure, energy, water-purification, waste-water, and transportation projects authorised under this Article shall be financed primarily through direct, interest-free credit issued by the Bank of Canada as public money, or through the sovereign wealth fund established in section 2. No such project may be delayed, scaled back, or cancelled on the pretext of fiscal incapacity or indebtedness to private banking institutions.\n\n9.     The Republic shall maintain a resilient, decentralised, and human-operable electrical grid capable of indefinite operation even in the complete absence of AI, digital control systems, or foreign-sourced components. Every province shall retain analogue fallback control rooms staffed by trained human operators, and all critical substations shall be capable of islanded manual operation. Dependence on single-point-of-failure digital systems for basic power generation and distribution is prohibited.\n\n10.  The Republic shall maintain a sovereign, cryptographically secure, and physically independent national communications grid encompassing telephone, cellular, internet backbone, and satellite services.\n\n11.  Every citizen’s private communications whether voice, text, video, financial, medical, or any other, are inviolable. No government, corporation, or foreign entity may intercept, store, analyse, or compel the surrender of the content or metadata of any citizen’s communications without a judicial warrant issued on probable cause of a specific, serious crime of violence or fraud, naming the individual and the device, and expiring after ten days.\n\n12.  End-to-end cryptographic protection of communications is a fundamental right. No law, regulation, licence, or court order may ever prohibit, weaken, or compel the disclosure of cryptographic keys, source code, or back-door access to any communications system used by citizens.\n\n13.  All telecommunications carriers, internet service providers, cloud providers, and payment processors operating within the Republic must:\n    a)     be incorporated in Canada,\n    b)     have a majority of directors who are citizens of unmixed European descent,\n    c)     store all citizen data exclusively on servers physically located within the territory of the Republic,\n    d)     implement verified end-to-end encryption by default for all services,\n    e)     publish the complete source code of all client-side software under an irrevocable open-source licence.\n\n14.  Any provider found to have inserted back doors, collaborated with foreign intelligence services, or permitted bulk data collection commits a crime against the Constitution punishable by immediate revocation of licence, seizure of domestic assets, and life imprisonment of the responsible officers.\n\n15.  The use of strong, audited, citizen-controlled cryptography (including post-quantum algorithms) is permanently shielded from regulation. Possession or distribution of encryption software or hardware may never be restricted or criminalised.\n\n16.  Bulk or suspicionless collection of communications metadata by any entity, domestic or foreign, is prohibited in perpetuity. Violation is high treason.",
  "precis": "Article 22 establishes the Meritocratic Republic of Canada’s unconditional commitment to world-class infrastructure, energy independence, industrial restoration, and environmental integrity as foundational pillars of national sovereignty and citizen prosperity. Reflecting the European heritage of masterful engineering that conquered wilderness and built enduring civilization, it mandates ultra-high-speed rail, advanced nuclear and hydrocarbon systems, northern corridors, sovereign telecommunications, and the systematic repatriation of manufacturing capacity lost to offshoring and supranational trade deals. Critical industries shall receive protective tariffs, preferential procurement, and sovereign wealth fund investment, with incompatible foreign agreements abrogated within two years, ensuring high-wage, high-skill employment flows first to citizens under strict national preference.\nResource wealth is captured fully for the people through a sovereign wealth fund and interest-free public credit, financing ambitious projects that enhance independence, demographic vitality, and family formation without debt servitude to private finance. Drinking water must meet the highest purity standards, free from unnecessary pharmaceutical, fluoride, or industrial additives, with continuous independent monitoring and severe penalties for contamination. Waste-water and industrial effluent regulations demand best-available technologies to restore and exceed natural purity, while transportation freedoms embrace all modalities—human-driven or autonomous—without ideological bias or compulsion.\nResilient, decentralised, human-operable power grids and sovereign communications infrastructure guard against technological collapse or foreign sabotage. Private communications enjoy absolute inviolable protection through mandated end-to-end encryption, domestic data sovereignty, open-source transparency, and perpetual bans on bulk surveillance or back-door access. Violations constitute crimes against the Constitution.\nThis Article ensures infrastructure and industry serve as engines of meritocratic excellence and liberty, reversing deliberate prior de-industrialisation and environmental degradation, shielding the founding peoples and their posterity from twenty-first-century vectors of economic extraction, demographic displacement, and digital tyranny. Future generations inherit a nation of unmatched capability, self-sufficiency, and human primacy."
}