{
  "number": 31,
  "title": "Abrogation and the Eternal Right of the People",
  "content": "1.     Upon the ratification of this Constitution, all statutes, regulations, orders-in-council, judicial precedents, international treaties, conventions, agreements, compacts, and obligations entered into by or in the name of Canada, the Dominion of Canada, or any predecessor entity that are incompatible with the letter or spirit of this Constitution are declared null and void ab initio and of no legal force or effect. No court, official, or international body may recognise or enforce any such abrogated law or obligation.\n\n2.     Within five years of ratification, the House of the Republic shall enact a Schedule of Retained Statutes listing those pre-existing laws deemed fully compatible with this Constitution. Any law not included in that Schedule shall lapse automatically and permanently at the end of the fifth year.\n\n3.     The provisions of this section are part of the unamendable core of this Constitution and may only be altered by the procedure set forth in Article 30 for the unamendable provisions.\n\n4.     Transitional Population of National Registries\n     a)     Within ninety days of ratification, the Supreme Court shall appoint the Registrar of Constitutional Registries per Article 2, section 4d. Upon appointment, the Registrar shall immediately commence the process of populating the National Registry of Citizens and the National Registry of Qualified Experts, utilizing subordinate staff and, if deemed necessary, forming ad-hoc transitional teams composed of qualified citizens (of unmixed European descent) with expertise in genealogy, data verification, and administration. The Registrar shall collaborate with domestic accredited institutions, pre-ratification government records, and the public to ensure comprehensive, merit-based enrollment.\n     b)     For the National Registry of Citizens: A mandatory twelve-month application window shall open post-appointment for all pre-ratification Canadian citizens and residents to apply for entry, requiring proof of unmixed European descent per Article 9, section 3 (e.g., civil records, statutory declarations, or subsidized DNA tests from Registrar-accredited labs). Existing federal records for registered Indians and Métis (as of December 31, 2025) shall be automatically imported and verified, with lineal descendants applying via simplified forms. Non-qualifying applicants default to permanent resident status without political rights.\n     c)     For the National Registry of Qualified Experts: All accredited institutions (domestic and foreign, if degrees were recognized pre-ratification) shall submit historical graduate records for Republic citizens (retroactive fifty years), including degree details, within six months of the Registrar's request. The Registrar shall verify descent per Article 9, section 3 through cross-referencing or requiring supplemental proof from individuals. Individuals may self-register with certified transcripts. Omissions or delays incur fines up to ten percent of institutional funding.\n     d)     All operations shall comply with the security protocols in Article 2, section 4d from inception, funded from the sovereign wealth fund under Article 20. Fraud or sabotage shall be punished per Article 2, section 4e. The Registrar shall publish quarterly anonymized progress reports to ensure transparency and merit-based integrity.\n\n\n\nThis Constitution is ordained to secure the liberty, prosperity, merit, and happiness of the Canadian people and their posterity for ages yet unborn. It is designed to endure so long as it fulfils that sacred purpose. Nevertheless, should unforeseen circumstances or the advance of time reveal limitations in these Articles that manifestly endanger the freedom, security, vitality, or continued existence of the nation and its people, the sovereign people of Canada retain forever their inherent and unalienable right to alter, abolish, or wholly replace this Constitution with a new one, informed by the experience and lessons of its predecessor, through the same deliberate and resolute act of popular ratification.\n\nThe authors and ratifiers of this Constitution are under no illusion about the ferocity with which vested foreign and domestic powers will resist the restoration and establishment of a free, European, meritocratic nation. We expect that the act of ratification itself may invite covert, clandestine, or overt attack, whether economic, informational, biological, chemical, or kinetic, by those who profit from the subjugation of peoples. We declare in advance that no such attack, however cruel or sophisticated, can ever legitimise the surrender of this Constitution or the rights it secures. Future generations are hereby forewarned, forearmed, and charged to defend what we have claimed, by any means necessary, so that liberty, truth, and the continuity of our blood and its merit may endure.\n\nUntil such time, if ever, this Constitution and its Charter shall stand as the supreme law of the Republic.\nthe Meritocratic People of Canada\nDecember 31, 2025",
  "precis": "Article 31 serves as the capstone of constitutional resilience, ensuring a clean break from outdated and tyrannical legacies while affirming the people’s eternal sovereignty to adapt or replace the framework if it fails its core purpose, drawing from the European tradition of revolutionary renewal as seen in the English Bill of Rights and French Declaration of the Rights of Man, which empowered citizens to overthrow oppressive systems. This provision is essential because it abrogates all incompatible pre-existing laws, treaties, and precedents upon ratification, preventing the carryover of bureaucratic entanglements or supranational obligations that could undermine meritocratic governance, securing freedoms by eliminating vectors for foreign influence or ideological subversion in a digital era where global entities seek to erode national autonomy. By mandating a five-year review to retain only compatible statutes and establishing transitional mechanisms for populating the National Registries of Citizens and Qualified Experts with verified entries of unmixed European descent, it averts crimes like the perpetuation of wasteful regulations or genocidal demographic policies, fostering a streamlined legal system that prioritizes competence and European cultural continuity, thus protecting posterity from the inertial tyrannies of inherited dysfunction.\n\nThis article also safeguards against stagnation by reserving the people’s unalienable right to refound the Constitution through deliberate processes, reflecting the meritocratic principle that governance must evolve with technological and existential challenges without hasty disruption. It prevents crimes such as elite capture or external attacks during transition by forewarning of potential assaults (economic, informational, or kinetic) and charging future generations to defend the framework by any means, aligning with the Charter’s emphasis on positive eugenics and family sovereignty to ensure the founding peoples’ legacy endures. The unamendable status of this section reinforces its role as a bulwark, thwarting attempts to entrench power structures that stifle inquiry or economic liberty, thereby enhancing the human experience of freedom in a future where artificial intelligence and warfare could otherwise exploit rigid or obsolete systems.\n\nArticle 31 fortifies the Republic’s adaptability while anchoring it in eternal principles, shielding citizens from the perils of legal chaos or revolutionary excess that have plagued nations amid rapid progress. It prevents the crime of perpetual subjugation by empowering merit-driven renewal, ensuring that the European-descended people’s dominion over their homeland remains secure against internal decay or external threats. In doing so, it upholds a constitution designed not as an end but as a living instrument for prosperity, where freedom is defended vigilantly for generations to come."
}