{
  "number": 13,
  "title": "Structure of Government",
  "content": "The Republic of Canada shall be governed by a simple, transparent, and meritocratic system designed for the 21st century and beyond. Permanent political parties, whipped votes, and hereditary parliamentary theatrics are abolished. Government shall be conducted by individual citizens of proven character and competence who are directly accountable to the people at all times.\n\n1.     The Legislature shall be unicameral and named the House of the Republic. It shall consist of exactly 333 members. Members shall serve terms of six years. Elections shall be held on fixed dates every two years for one-third of the seats (111 members), with the seats divided into three equal cohorts serving staggered terms. At the first election following ratification, the cohorts shall be assigned initial terms of two, four, or six years by lot to establish the staggered cycle; thereafter, all successful candidates shall serve full six-year terms.\n\n2.     Elections shall be by first-past-the-post in single-member ridings of roughly equal population. No party lists, no proportional representation, no preferential voting, and no reserved seats. Every member stands as an individual citizen, not as a delegate of a party.\n\n3.     Political parties are not recognised in law. No public funding, no tax status, no official party whips, no party names on ballots, and no party discipline enforced by the Speaker. Candidates may describe themselves however they wish, but the ballot shall list only the candidate’s personal name and riding.\n\n4.     The head of government shall be the Prime Minister of the Republic, directly elected by the whole people in a national two-round system at the same fixed election dates as the House cohorts. If no candidate obtains 50 % + 1 in the first round, a run-off between the top two is held two weeks later. The Prime Minister shall serve a term of six years, aligned with the full staggered cycle of the House.\n\n5.     The Prime Minister:\n      a)     appoints and dismisses ministers (who need not be members of the House),\n      b)     is commander-in-chief,\n      c)     negotiates and ratifies treaties (subject to two-thirds approval of the House),\n      d)     may veto legislation (veto override requires a three-quarters vote of the House),\n      e)     may dissolve the House and call early elections once per term if the budget or supply bill fails twice. The Prime Minister may not introduce legislation or vote in the House.\n\n6.     Ministers are individually responsible to the House. Any minister may be removed by a simple majority vote of no confidence on a motion that names the minister personally. The Prime Minister must dismiss that minister within 48 hours.\n\n7.     The House may remove the Prime Minister by a constructive vote of no confidence: a three-quarters majority that simultaneously names a replacement Prime Minister who is immediately sworn in. This power may be used only once per term.\n\n8.     Any law passed by the House of the Republic and assented to by the Prime Minister shall be suspended from taking effect if, within ninety days of passage, a petition signed by no fewer than five percent of the enfranchised citizens of the Republic, verified by the National Registry under Article 9, demands its submission to a binding national referendum. The referendum shall be held within one hundred eighty days of petition validation. If a majority of votes cast reject the law, it is permanently void. If approved, it takes immediate effect without further recourse. Petitions must specify the exact title and text of the challenged law; no general or vague demands are permitted.\n\n9.     The House of the Republic, by a two-thirds vote, or the Prime Minister, may refer any bill that has passed the House to a binding national referendum before final assent. The referendum shall be held within one hundred twenty days. If a majority of votes cast approve the bill, the Prime Minister shall grant assent without delay. If rejected, the bill is defeated. This power exists to resolve matters of profound national controversy or constitutional significance where direct expression of the people’s will is deemed essential to legitimacy.\n\n10.    Question Period is abolished in its current theatrical form. Instead, every Wednesday the Prime Minister and every minister shall appear in person before the House for a maximum of three hours of direct, unscripted questioning by any member. Questions are limited to two minutes; answers to four minutes. No points of order, no props, no applause, no prepared talking points. The Speaker’s role is time-keeping and enforcing basic decorum. Sessions are live-streamed and permanently archived. The Speaker shall have the authority to enforce decorum by the following measures, applied progressively:\n            i)      verbal warning;\n           ii)     deduction of the member’s remaining question or answer time in that session;\n          iii)    temporary expulsion from the chamber for the remainder of the day’s sitting;\n           iv)    in cases of repeated or egregious violation, suspension of the member’s right to pose questions for up to four consecutive Wednesdays.\n            All disciplinary actions shall be recorded in the minutes and published immediately. Appeals against the Speaker’s ruling may be made to the full House, but only by written motion requiring a two-thirds vote to overturn.\n\n11.    All votes in the House are recorded by name and published within one hour. There is no secret ballot for any legislative matter.\n\n12.    Members of the House may not serve simultaneously as ministers or as provincial legislators. Members receive a salary fixed at twice the national median wage and are subject to immediate recall by petition of ten percent of their riding’s electors (Article 12, section 2).\n\n13.    The provinces retain exclusive jurisdiction over education, health, municipal institutions, property and civil rights, natural resources within their boundaries, and all matters of a purely local or private nature. All residual powers belong to the national government. No concurrent powers exist except where explicitly stated in this Constitution.\n\n14.    The Speaker of the House is elected by secret ballot of the members at the opening of each new House cohort cycle and serves for six years. The Speaker may not be removed except by a two-thirds vote for cause.\n\n15.    All other rules and procedures for the consideration and enactment of legislation shall be determined by the House of the Republic in standing orders adopted and amendable by simple majority vote of its members.",
  "precis": "Article 13 establishes the governmental framework of the Meritocratic Republic of Canada as a streamlined, transparent system rooted in individual merit and direct accountability. It eliminates permanent political parties, whipped votes, and performative parliamentary traditions, ensuring that governance is carried out by citizens of demonstrated character and competence who remain answerable to the people without intermediary factions.\n\nThe unicameral House of the Republic comprises 333 members elected by first-past-the-post in single-member ridings of equal population, with staggered six-year terms and fixed election cycles for one-third of seats every two years. Political parties receive no legal recognition, funding, or ballot presence; candidates stand solely as individuals. The Prime Minister, directly elected nationally through a two-round system for a six-year term, holds executive authority—including appointment of ministers, command of the armed forces, treaty negotiation (subject to House approval), legislative veto (overridable by three-quarters vote), and limited dissolution power—while remaining separate from legislative introduction or voting.\n\nMinisters face individual no-confidence removal by simple majority, compelling swift dismissal by the Prime Minister. The Prime Minister may be removed only through a constructive no-confidence vote requiring a three-quarters majority that simultaneously designates a successor, usable once per term.\n\nNew direct democratic safeguards strengthen popular sovereignty: any law may be suspended and submitted to binding national referendum if five percent of enfranchised citizens petition within ninety days of passage; the House (by two-thirds) or Prime Minister may also refer controversial bills to referendum before assent. These mechanisms ensure that legislation of profound national impact cannot be imposed against clear public will, protecting against elite capture, transient majorities, or detachment from the citizenry.\n\nAccountability is reinforced through mandatory weekly unscripted questioning sessions, fully recorded named votes published within one hour, recall provisions, modest salaries tied to median wage, and strict separation of roles. Provincial jurisdiction remains exclusive over local matters, with residual powers national, preserving federal balance without overlap.\n\nBy embedding meritocratic selection, transparent process, and direct citizen checks—including referenda—this structure safeguards the European heritage of ordered liberty and self-governance against contemporary and future threats: factional corruption, bureaucratic overreach, technological manipulation, and erosion of cultural continuity. It secures a system where excellence and competence prevail, enabling citizens to exercise authentic freedom in the modern era and beyond."
}