{
  "number": 28,
  "title": "Military Service, National Defence, and Policing",
  "content": "1.     The armed forces, the Ministry of War, of the Republic of Canada, exist solely to defend the territory, citizens, and Constitution of the Republic against all enemies, foreign and domestic. They shall never be deployed outside the territory of the Republic except in direct response to an attack upon Canadian soil or citizens, or in coalition with other nations of European descent facing existential threat. Under no circumstances shall the armed forces be deployed against any nation of European descent, nor shall they participate in any conflict that pits nations of European descent against one another.\n\n2.     Every male citizen aged eighteen to forty-five is liable for military service. Service shall be compulsory for a period of twenty-four months between the ages of eighteen and twenty-five, unless exempted for verified physical or mental incapacity, or for conscientious objection limited to non-combat roles. Female citizens may volunteer on equal terms.\n\n3.     The armed forces shall be maintained at a permanent minimum strength of 1.5 % of the citizen population under arms in peacetime, rising automatically to 4 % upon declaration of national emergency.\n\n4.     The armed forces of the Republic shall maintain dedicated capabilities for the suppression of wildland fires threatening the territory, citizens, infrastructure, and ecological integrity of the nation. This mission includes procurement, maintenance, and operation of aerial water-bomber fleets, ground suppression units, and preventive fuel-management operations on public lands. During peacetime and compulsory service, personnel shall receive training in wildland firefighting techniques, aerial coordination, and environmental stewardship. Provincial authorities retain primary coordination of routine fire management, with military assets activated upon provincial request or national declaration when civilian resources are overwhelmed. Such fire-suppression forces may be deployed internationally on strictly humanitarian grounds, without combat implications, upon approval by a two-thirds vote of the House.\n\n5.     All members of the armed forces and police shall swear allegiance solely to the Constitution and the Canadian people. No oath to any foreign entity, supranational body, or abstract ideology shall be required or permitted.\n\n6.     The Royal Canadian Mounted Police (RCMP) shall serve as the national police force with exclusive jurisdiction over treason, espionage, organized crime crossing provincial boundaries, human trafficking, major financial fraud, and threats to constitutional order. Routine policing, traffic enforcement, and local crime shall remain provincial responsibilities. No private security firm may exercise powers of arrest or investigation beyond immediate citizen’s arrest on private property.\n\n7.     No military or police force may ever be used against peaceful citizens exercising constitutional rights. Intelligence agencies shall operate under strict judicial oversight with immutable, publicly auditable data archives. Deployment of armed forces domestically requires a recorded, public two-thirds vote of the House and automatic review by a special tribunal within thirty days.",
  "precis": "Article 28 establishes the framework for military service, national defence, and policing in the Meritocratic Republic of Canada, ensuring that the armed forces exist solely to protect the territory, citizens, and Constitution from genuine threats while embodying the European tradition of disciplined, citizen-based defence that secured the continent against adversity. In an era where global entanglements and internal weaknesses have exposed nations to existential risks, this provision mandates compulsory service for male citizens with voluntary options for females, building a capable, trained populace ready to safeguard the nation’s independence and demographic continuity. By limiting deployments to direct defence or coalitions with kindred European nations and prohibiting involvement in fratricidal conflicts, it prevents the misuse of blood and treasure in foreign adventures that have historically drained vitality from European peoples, securing the freedom of sovereign existence.\n\nThis article also fortifies internal security through a clear division of policing powers, with the RCMP handling national threats like treason, organized crime, and human trafficking, while provinces manage routine order, thereby preventing the centralization of force that could enable authoritarian control or the privatization of justice that invites corruption. It secures freedoms by mandating allegiance solely to the Constitution, prohibiting the use of military or police against peaceful citizens, and embedding safeguards against intelligence abuses, such as mandatory tribunals for deployment decisions and immutable data archives, which thwart crimes like fabricated evidence leading to unjust wars or domestic surveillance that stifles dissent. Rooted in the European heritage of accountable governance, as seen in Magna Carta’s curbs on arbitrary power, these measures address modern risks like electromagnetic warfare and non-state actors, ensuring that policing enhances meritocratic society by targeting real harms such as drug trafficking and fraud without infringing on individual liberties or fostering dependency on foreign entities. The provision for deploying fire-suppression forces internationally on humanitarian grounds, without military implications, promotes goodwill and practical cooperation, reflecting a compassionate yet sovereign approach to global challenges like devastating wildfires.\n\nUltimately, Article 28 enhances the human experience of freedom by integrating defense and policing into a merit-driven system that prepares citizens for both martial and civic excellence, shielding future generations from the perils of weakness or overreach that have undermined nations in the technological age. It prevents genocidal threats through demographic displacement by maintaining armed neutrality and a capable force, aligning with the Charter’s emphasis on positive eugenics and cultural preservation to uphold the European founders’ legacy. In doing so, it promotes a republic where security bolsters prosperity, allowing individuals to thrive without the shadows of unchecked power or existential vulnerability."
}