{
  "number": 9,
  "title": "Citizenship, Descent, and National Registries",
  "content": "1.     Citizenship in the Republic of Canada is reserved exclusively to persons of unmixed European descent and to the historically recognised Métis people and pre-Confederation Indian inhabitants and their lineal descendants as defined in section 10 below. No other principle of membership may ever be substituted or added.\n2.     Full citizenship with all political rights may be granted only to individuals who can demonstrate unmixed European descent from any European population worldwide.\n3.     Proof of unmixed European descent shall be established by one or more of the following, in descending order of precedence: \n      a)     Civil birth, baptismal, marriage, and death records from any recognised European jurisdiction or ecclesiastical authority; \n      b)     Statutory declarations from two citizens of full standing attesting to personal knowledge of the applicant’s unbroken European lineage; \n      c)     DNA evidence from a laboratory accredited by the Registrar of Constitutional Registries showing 100 % European ancestry according to the Registry’s published reference populations. \nFalse or fraudulent submissions are punishable by permanent exile and ten years’ imprisonment.\n4.     Citizenship by birth is granted to every child who has at least one parent who is a full citizen of the Republic at the time of the child’s birth, regardless of the place of birth, and is of unmixed European descent.\n5.     Naturalisation of persons of unmixed European descent is permitted under the following conditions: \n      a)     Minimum five years of continuous lawful residence;\n      b)     Demonstrated mastery of English or French;\n      c)     Proof of unmixed European descent under section 3; \n      d)     Good character and demonstrated contribution to the Republic;\n      e)     Public renunciation of any previous citizenship and pledge of allegiance to the Republic.\n6.     After the date of ratification, no person of non-European ancestry (except the grandfathered Métis and Indian individuals under section 10) may ever acquire citizenship under any circumstance.\n7.     Dual or multiple citizenship is permanently prohibited for the Prime Minister, ministers, members of the House, judges, senior civil servants, commissioned officers, and any person exercising political rights. Any citizen who acquires or retains another citizenship forfeits Canadian citizenship and its franchise rights automatically. This forfeiture does not apply to involuntary foreign citizenship acquired at birth, which may be retained during minority without penalty; however, parents may renounce it on the child's behalf at any time before age 18, and the individual must renounce it upon reaching age 18 to retain Republic citizenship.\n8.     Loss of citizenship may occur only for voluntary acquisition of another citizenship, proven service in a foreign armed force against the Republic, or conviction for high treason or crime against the Constitution, and only after majority verdict of a special tribunal of three superior-court judges.\n9.     The Meritocratic Republic of Canada declares itself a homeland and refuge for all peoples of European descent worldwide. No numerical quota or “diversity” consideration may ever be used to restrict the immigration or naturalisation of unmixed Europeans so long as the demographic continuity provisions of this Constitution remain in force.\n10.  Every individual who, on the date of ratification, possesses registered Indian status under the former Indian Act or recognised Métis citizenship under the criteria in force on 31 December 2025, together with their lineal descendants, is immediately and irrevocably granted full citizenship on the same terms and with the same rights and duties as citizens of unmixed European descent. This grant is a final, one-time, and non-expandable act of historic reconciliation. No new Indian or Métis citizenship categories may ever be created, and all separate legal status, reserves, and race-based programmes are abolished as per Article 8. On the tenth anniversary of ratification, all administrative designations in the National Registry of Citizens that identify citizens as having been granted citizenship under section 10 shall be permanently removed. From that day forward, the Republic recognises only one category of citizen, with no distinction whatsoever by ancestry or historical origin.\n11.  The Registrar of Constitutional Registries\nThe National Registry of Citizens and the National Registry of Qualified Experts shall be administered by a constitutionally protected office titled the Registrar of Constitutional Registries, appointed for a single non-renewable 15-year term by unanimous vote of the nine senior justices of the Supreme Court.\nThe Registrar and all subordinate staff shall be citizens of unmixed European descent, born in the Republic, with no dual citizenship and no family or financial ties to any university or research institute, religious organization, bank, government office, foreign state, or technology firm in the preceding twenty years nor during their term of service.\nCompensation shall be fixed at seven times the national median wage. The Registrar shall be guarded with the same state protection afforded to Supreme Court justices. Any threat, bribe, or act of violence against the Registrar or staff in connection with their duties is punishable by death.\n12.  National Registry of Qualified Experts\nEvery university or accredited institution within the Republic shall, upon conferral of a baccalaureate degree or higher or their equivalents in any field of learning, automatically transmit the graduate’s name, degree, field, and contact details for storage within the encrypted National Registry of Qualified Experts. Entries remain in the Registry for life unless the individual formally renounces citizenship. The size and composition of the Registry is public; individual entries are accessible only to the blind-lot selection algorithm and the Registrar.\nThe National Registry of Qualified Experts shall be maintained simultaneously in at least five geographically dispersed, physically hardened, and mutually independent forms:\ni)      an encrypted digital master ledger with real-time replication across multiple sovereign data centres;\nii)     immutable paper archive copies sealed in fire-proof and flood-proof vaults in at least three provinces;\niii)   micro-etched or equivalently permanent physical media capable of surviving at least one thousand years without powered maintenance (e.g., optically inscribed sapphire or nickel plates) stored in deep underground facilities;\niv)   any additional redundant forms the Supreme Court deems prudent.\nIn the event of digital systems becoming inaccessible, the most recent verified paper or physical-media copy shall immediately become the sole legal master. In the event that no copies become accessible or available, selection shall be performed by blind randomized selection from the public. The Supreme Court shall maintain permanent standing procedures and trained custodial personnel to effect these transitions within twenty-four hours.\nWithin one year of ratification and every two years thereafter, the Registrar of the Supreme Court shall certify in a public report that all redundant copies are complete, verified, and synchronised. Failure to issue this certification or the discovery of any deliberate tampering shall trigger an immediate national emergency inquiry under Article 11 and constitute a crime against the Constitution as outlined below.\nNo entry in the Registry may be altered, deleted, or redacted but for clerical correction of manifest error certified by unanimous order of three senior justices. Automatic expungement occurs only upon proof of the individual’s death or formal renunciation of citizenship, and the historical record of the entry shall remain archived in anonymised form for statistical and audit purposes.\nDeliberate omission or falsification of registration data by an issuing institution, or any attempt to corrupt the Registry or selection process, is punishable as a crime against the Constitution.\n13.  National Registry of Citizens\nA permanent National Registry of Citizens shall be maintained by the Registrar of Constitutional Registries.\na)     Every citizen shall receive a lifelong citizenship certificate.\nb)     This registry shall be secured by the means as described for the National Registry of Qualified Experts.\nc)     Annual public statistics on the ethnic and ancestral composition of the citizenry shall be published.\nd)     The National Registry of Citizens shall contain no data beyond that strictly required to prove living citizenship and unmixed European descent. No government may ever add fields for education, income, occupation, health, criminal record, political affiliation, or any other attribute which might facilitate social crediting modalities.\ne)     The registration shall include a unique citizenship identification string composed of ten alphanumeric characters comprising the numerals zero through nine (0-9) and uppercase A through Z (A-Z), which shall be used for authenticated anonymized voting and other relevant responsibilities of the franchise.\nf)      The birth of every child born to at least one citizen parent shall be registered with the Registrar of Constitutional Registries within thirty days of birth, or as soon as practicable in cases of birth abroad or medical emergency.\ng)     Registration shall include submission of the parents’ citizenship identification strings and any additional proof required under section 3 to confirm the child’s unmixed European descent where not already established by the verified status of the citizen parent(s). Upon satisfactory verification, the Registrar shall immediately enter the child into the National Registry of Citizens and issue a lifelong citizenship certificate.\nh)     Failure to register within the prescribed period without reasonable cause incurs no penalty against the child but requires prompt rectification by the parents or guardians.\ni)      Hospitals, midwives, and other birth attendants within the Republic shall provide parents with registration forms and instructions as a routine duty.\nj)      Metadata tied to the identification string shall be limited to the following essential metadata:\ni)      time of birth determined to the minute, as 24-hour format HH:MM:SS, local time\nii)     date of birth as year, month, day YYYY:MM:DD, local day\niii)   place of birth, with fields for town or city, county, and province, or if abroad, foreign location data\niv)   parental citizenship identification string from each parent\nv)     biological sex\nvi)   full legal name at birth, with fields for first, middle(s), and last name\nvii)  date, time, and place of death, entered only upon verified posthumous notification, in the same format as subclauses i), ii), iii).\nviii)  one or more fields for ethnic and ancestral data\nk)     The death of any citizen shall be reported to the Registrar of Constitutional Registries within thirty days of occurrence, or as soon as practicable, by next-of-kin, medical authorities, or funeral directors. Reporting shall include the deceased’s citizenship identification string and corroborating evidence (e.g., medical certificate of death). Upon verification, the Registrar shall update the registry with the date and time of death. Failure to report without reasonable cause incurs no penalty against heirs but requires prompt rectification. Any wilful failure to report, where such failure enables continued receipt of Republic financial support payable to or on behalf of the deceased, shall constitute fraud against the public treasury and be punished accordingly.\n14.  Registry Sabotage\nAny person who knowingly or with wilful blindness:\ni)      inserts, deletes, alters, or falsifies any entry in the National Registry of Citizens or the National Registry of Qualified Experts except for manifest clerical correction certified by unanimous order of three senior justices;\nii)     omits or delays the registration of any legitimately conferred degree or citizenship;\niii)   tampers with, destroys, degrades, or impairs access to any of the redundant physical, cryptographic, or analog backups of either registry;\niv)   facilitates unauthorized readout, exfiltration, copying, mirroring, statistical reconstruction, or disclosure of any portion of either registry (including metadata or selection probabilities), or the knowing use of such unlawfully obtained data for any purpose whatsoever; or\nv)     aids, abets, counsels, or conspires in any of the above acts,\ncommits the crime of Registry Sabotage, a crime against the Constitution and against the posterity of the nation. Upon conviction by majority verdict of a special tribunal of seven senior justices, the penalty shall be death. There shall be no possibility of pardon, commutation, or appeal beyond the initial tribunal.\n15.  Transitional Population of National Registries\na)   Within ninety days of ratification, the Supreme Court shall appoint the Registrar of Constitutional Registries per Article 2, section 4d. Upon appointment, the Registrar shall immediately commence the process of populating the National Registry of Citizens and the National Registry of Qualified Experts, utilizing subordinate staff and, if deemed necessary, forming ad-hoc transitional teams composed of qualified citizens (of unmixed European descent) with expertise in genealogy, data verification, and administration. The Registrar shall collaborate with domestic accredited institutions, pre-ratification government records, and the public to ensure comprehensive, merit-based enrollment.\nb)   For the National Registry of Citizens: A mandatory twelve-month application window shall open post-appointment for all pre-ratification Canadian citizens and residents to apply for entry, requiring proof of unmixed European descent per Article 9, section 3 (e.g., civil records, statutory declarations, or subsidized DNA tests from Registrar-accredited labs). Existing federal records for registered Indians and Métis (as of December 31, 2025) shall be automatically imported and verified, with lineal descendants applying via simplified forms. Non-qualifying applicants default to permanent resident status without political rights.\nc)   For the National Registry of Qualified Experts: All accredited institutions (domestic and foreign, if degrees were recognized pre-ratification) shall submit historical graduate records for Republic citizens (retroactive fifty years), including degree details, within six months of the Registrar's request. The Registrar shall verify descent per Article 9, section 3 through cross-referencing or requiring supplemental proof from individuals. Individuals may self-register with certified transcripts. Omissions or delays incur fines up to ten percent of institutional funding.\nd)   All operations shall comply with the security protocols in Article 2, section 4d from inception, funded from the sovereign wealth fund under Article 20. Fraud or sabotage shall be punished per Article 2, section 4e. The Registrar shall publish quarterly anonymized progress reports to ensure transparency and merit-based integrity.\n16.  Transitional Demographic Restoration\na)     Upon ratification of this Constitution, the Republic shall establish a National Registry and Continuity Directorate (NRCD) by repurposing and restructuring the existing Canada Border Services Agency. The NRCD shall have sole authority to verify residency status against the National Registry of Citizens established under Article 9, identify non-qualifying residents, and enforce orderly departure from the territory of the Republic.\nb)     A phased remigration program shall commence within ninety days of ratification and continue until the prohibitions against demographic displacement in Charter Clause 6 and Article 8 are fully satisfied.\ni)      Phase priority shall proceed as follows:\n(i)    All holders of temporary visas, work permits, study permits, visitor status, and undocumented entrants;\n(ii)   Permanent residents granted status most recently, proceeding chronologically backward by date of landing;\n(iii)  All other non-citizens and non-qualifying long-term residents.\nii)     The NRCD shall issue formal departure notices with reasonable timelines proportionate to length of prior residence, not exceeding twenty-four months for any individual.\niii)   Voluntary compliance shall be incentivised through one-time repatriation assistance, including travel costs and a modest resettlement grant funded from the sovereign wealth fund.\nc)     Non-qualifying residents may apply for limited hardship exceptions through a special judicial panel, but no exception shall be granted on grounds of economic contribution, length of residence alone, or family ties formed subsequent to arrival unless all dependents independently qualify under Article 9 descent requirements. Exceptions shall expire after five years and are non-renewable.\nd)     Failure to depart within the allotted period shall result in loss of all access to public services, employment in regulated sectors, banking services, and property transfer rights, followed by enforced removal. Property lawfully acquired may be sold at fair market value within the departure timeline; unsold assets shall revert to the Republic as compensation for prior public subsidisation.\ne)     The NRCD shall operate under strict judicial oversight for individual cases while retaining full executive discretion to meet the constitutional mandate of demographic restoration. Annual public reports on progress toward satisfaction of Charter Clause 6 and Article 8 shall be submitted to the legislature.\nf)      This Article shall expire automatically upon certification by the National Registry that demographic continuity has been restored to levels consistent with the founding European character of the nation as it existed prior to deliberate policy-induced displacement.",
  "precis": "Article 9 defines citizenship in the Meritocratic Republic of Canada as an exclusive inheritance reserved to persons of unmixed European descent and, as a final historic act of reconciliation, to registered Indian status holders and recognised Métis under pre-2026 criteria together with their lineal descendants. This irrevocable limitation safeguards the European character, cultural continuity, and demographic integrity that the founding peoples established through centuries of settlement, preventing the existential threat of displacement or erasure that mass migration and ideological policies have inflicted elsewhere.\nCitizenship by descent is automatic for children of at least one citizen parent who meet the unmixed European standard, with rigorous proof required via civil records, statutory declarations, or accredited DNA evidence. Naturalisation for unmixed Europeans demands residence, linguistic mastery, good character, contribution, and sole allegiance. Dual citizenship is prohibited for all exercising political rights or holding high office, with automatic forfeiture for voluntary foreign allegiance. Loss of citizenship is restricted to narrow, judicially confirmed grounds.\nThe Republic declares itself an eternal homeland and refuge for unmixed Europeans worldwide, with no quotas or diversity mandates permitted to restrict their entry while demographic continuity provisions endure. On the tenth anniversary of ratification, all ancestral designations for grandfathered citizens vanish permanently from the Registry, establishing one indivisible category of citizen.\nCentralised under a constitutionally shielded Registrar of unmixed European descent, appointed for a single 15-year term by unanimous Supreme Court vote, are two inviolable national registries: the National Registry of Citizens and the National Registry of Qualified Experts. Both are secured by extraordinary redundant measures such as encrypted digital ledgers, immutable paper archives, millennial-duration physical media, and additional forms designed to survive technological collapse, sabotage, or catastrophe. Annual ethnic composition statistics are published, yet the Citizen Registry contains only minimal data essential to prove living citizenship and descent, explicitly forbidding expansion into social-credit fields.\nBirth and death registration procedures ensure timely accuracy, with wilful failure to report deaths enabling fraudulent public payments punished as treasury fraud. Registry Sabotage, which is any knowing insertion, deletion, tampering, omission, or unauthorised access, constitutes a crime against the Constitution and posterity, punishable by death upon conviction by special tribunal.\nA transitional provision mandates the establishment of a National Registry and Continuity Directorate to execute phased, orderly remigration of non-qualifying residents, prioritising recent arrivals and proceeding chronologically until Charter Clause 6 and Article 8 are fully satisfied, with voluntary incentives, limited hardship exceptions, and enforced removal for non-compliance. This mechanism expires automatically upon certified restoration of the founding European demographic character.\nThese mechanisms render citizenship, expert selection, and demographic restoration impervious to corruption, infiltration, or technological subversion, preserving meritocratic governance and the European heritage against twenty-first-century threats of demographic engineering, digital tyranny, or supranational dissolution. Future generations inherit a nation where shared descent and excellence, not abstract universalism, secure liberty and sovereignty."
}