{
  "number": 17,
  "title": "Marriage, Divorce, and the Protection of the Family",
  "content": "1.     Marriage is the lifelong union of one man and one woman to the exclusion of all others and may be entered into only between such persons. No law, regulation, or judicial decision may recognise any other form of union as marriage or confer upon it the legal incidents of marriage. The natural family of father, mother, and their children is recognised as the fundamental unit of society; no policy shall undermine its stability or authority. The state shall actively encourage high fertility among married couples through policies that honour parenthood as the highest civic virtue.\n\n2.     Each parent in a married couple shall be entitled, upon the birth or adoption of each child, to one full year of paid parental leave which may be taken concurrently or consecutively with absolute guarantee of return to the same or equivalent position for each parent. Employment protection during this leave is inviolable.\n      Funding shall come from the Family Insurance Fund (FIF), into which all citizens pay an annual premium of 1.5 % of their insurable earnings up to the Maximum Insurable Earnings (MIE) set annually at 1.5 times the national median wage. To qualify for full benefits, the claimant must have at least 300 hours of insurable employment in the prior 52 weeks.\n      The state payment shall replace 100 % of the higher-earning spouse’s verified average annual insurable earnings over the previous 24 months, subject to:\n      a)     A hard cap of the MIE;\n      b)     A minimum floor of the national median wage for qualified claimants; and\n      c)     A clawback of 30 % of benefits received if the family’s post-benefit net income exceeds twice the median wage in the following tax year.\n      Benefits are non-means-tested beyond contributions and the clawback. If one parent remains home full-time thereafter to raise the couple’s minor children until the youngest child reaches the age of fourteen, that parent qualifies for the means-tested support under Article 27, section 4, assessed against total family assets and income, for the duration of that period.\n\n3.     A permanent, ring-fenced Family Insurance Fund is hereby established for the sole purpose of paying the parental-leave benefits provided in section 2 and the ongoing family-carer support provided in Article 27, section 4.\n      a)     The Fund shall be financed exclusively by a dedicated 1.5 % contributory premium levied solely on employers in respect of each citizen employee’s insurable earnings up to the Maximum Insurable Earnings described in section 6. No general revenue, sovereign-wealth-fund monies, or borrowed funds may ever be used to supplement or replace these premiums.\n      b)     All premiums collected shall be deposited into a constitutionally protected account separate from all other public monies. No legislature, minister, or court may redirect, freeze, borrow from, or encumber the Fund for any other purpose. The Fund shall be managed by an independent board of trustees appointed for non-renewable fifteen-year terms by unanimous vote of the Supreme Court from a shortlist of qualified actuaries and financial experts nominated by the professional associations of the Republic. Annual actuarial reports and full financial statements shall be published publicly.\n      c)     Surplus reserves shall be invested conservatively in inflation-protected instruments and may be used only to reduce future premiums or enhance benefits within the scope of this Article and Article 27.\n\n4.     Divorce shall be granted only on proven grounds of fault: adultery, abandonment for at least one year, physical cruelty, or incurable addiction causing harm to the family. No-fault divorce is permanently prohibited. Upon filing for separation, automatic provisional orders shall issue immediately to maintain the status quo: joint access to marital finances, shared temporary custody where safe, and provisional support based on need and ability to pay.\n\n5.     In all divorce or separation proceedings, assets acquired during the marriage shall be divided equally by default, with deviations only for proven cause such as waste, concealment, or significant pre-marital contribution. Permanent alimony is abolished except in cases of proven disability preventing self-support or where one spouse has sacrificed career for full-time child-rearing and is over age fifty at separation; in such cases alimony is limited to five years or until remarriage.\n\n6.     Custody and decision-making authority for minor children shall default to equal shared parenting, with deviations only upon clear and convincing evidence of abuse, neglect, or unfitness. No presumption shall favour either parent based on sex. False allegations of abuse or unfitness, proven beyond reasonable doubt, constitute perjury and result in forfeiture of custody rights, financial penalties, and potential imprisonment.\n\n7.     The state shall maintain specialised family courts staffed by judges with demonstrated expertise in family dynamics and meritocratic principles. Proceedings shall be expedited, with final resolution required within six months of filing unless extraordinary cause is shown.",
  "precis": "Article 17 elevates marriage and the family as the bedrock of the Meritocratic Republic of Canada, recognizing them as essential to sustaining the European heritage that built the nation through generations of commitment, resilience, and cultural continuity. In an era where ideological forces and economic pressures have fragmented families, leading to plummeting birth rates and societal instability, this provision defines marriage exclusively as the lifelong union between one man and one woman, aligning with the biological and historical realities that foster stable societies and meritocratic excellence. By prohibiting recognition of other unions and actively encouraging high fertility through policies like generous parental leave, it secures the freedom of individuals to form enduring bonds without the distortions of transient cultural experiments, preventing the crimes of familial erosion that have contributed to demographic replacement and the loss of national vitality. This framework counters modern perils like work-life imbalances amplified by automation, ensuring that the family unit remains a sanctuary for raising competent, virtuous posterity in line with the Republic’s emphasis on positive eugenics and long-term prosperity.\n\nCentral to Article 17 is the merit-based protection of children and dependent spouses through a dedicated Family Insurance Fund, funded by employer premiums, which provides full-wage replacement for parental leave and ongoing support for caregivers, honoring parenthood as the highest civic virtue while addressing contemporary challenges of gig economies and dual-income pressures. By mandating swift, equitable resolutions in family courts with even splits of assets, custody, and decision-making as the default, deviating only for proven cause like abuse or abandonment, and punishing false allegations as perjury with forfeiture of rights, it deters manipulative tactics that exploit judicial systems for advantage, promoting instead a society where merit flourishes through stable homes that nurture innovation and self-reliance. These measures safeguard against the subversion of family law by supranational ideologies or corporate interests that prioritize individualism over collective continuity, ensuring that families thrive without the burdens of punitive policies seen in declining Western nations.\n\nFurthermore, by enforcing automatic protections upon separation, such as access to joint finances and provisional support, and imposing penalties for non-compliance, Article 17 protects individuals against weaponized harmful divorce machinations to individual well-being and security. This forward-looking approach preserves the human experience of familial freedom, guaranteeing that posterity inherits a meritocracy where strong families drive national strength rather than serve as battlegrounds for cultural wars. In upholding these principles, the Article ensures Canada's European character endures, protecting the freedoms of love, legacy, and lineage from the vectors of modern tyranny."
}