{
  "number": 11,
  "title": "Emergency Powers",
  "content": "Article 11 – Emergency Powers\n\n1.     No declaration of emergency may ever suspend, limit, or postpone the operation of any provision of this Constitution or the Charter of Rights and Freedoms, under any circumstances whatsoever.\n2.     Operational Orders\n      a)     In the event of foreign invasion, declared war, or an imminent natural or technological or other catastrophe that manifestly threatens the physical survival of the nation or a significant portion thereof, the executive may issue temporary operational orders limited strictly to the coordination of defence, evacuation, or life-saving measures.\n      b)     No order issued under this Article may ever authorise the confiscation of firearms, the freezing of assets, the restriction of speech or assembly, the suspension of habeas corpus, or the imposition of medical mandates. Restriction of movement is permitted only within the immediate zone of physical danger and only for the duration of the manifest threat.\n      c)     Every such order expires automatically after seventy-two hours unless ratified by a recorded, public, three-quarters vote of the elected House of the Republic, live-streamed to the people. No renewal may exceed seven days, and total duration may never exceed thirty days consecutively.\n3.     Any citizen may challenge any operational order instantly before a special three-judge panel drawn by lot from the senior judiciary. The filing of such challenge automatically stays the challenged portion of the order pending the decision. The panel must hear the matter and render a binding decision within twenty-four hours. Frivolous or vexatious challenges, or challenges filed in manifest bad faith, shall expose the filer to summary contempt proceedings and a fine of up to three year’s median wage, payable to the public treasury.\n      a)     No citizen challenge shall stay any operational order, or portion thereof, that the executive certifies in writing is immediately necessary to prevent loss of human life or catastrophic destruction of inhabited property during an active natural disaster (wildfire, flood, earthquake, volcanic eruption, hurricane, or equivalent event). In such cases the three-judge panel shall hear the challenge on an expedited basis and render a binding decision within six hours of filing, but the challenged measure remains fully in force until the panel rules. The panel may issue a stay only by unanimous vote and only upon finding that the measure is manifestly unrelated to the immediate preservation of life or inhabited property. Any citizen who knowingly files a frivolous or malicious challenge under this subsection that results in provable loss of life or destruction of inhabited property shall be guilty of depraved-indifference homicide and punished accordingly.\n      b)     No citizen challenge may stay or delay any national emergency declaration triggered automatically by:\n            i)      confirmed or credibly alleged deliberate tampering with the National Registry of Citizens or the National Registry of Qualified Experts; or\n           ii)     any attack, sabotage, or degradation of the redundant physical or cryptographic backups of those registries.\n            In such cases the emergency powers remain in full force until the Tribunal of Inquiry under section 4 has completed its report or until the Supreme Court, by unanimous vote of nine senior justices sitting en banc, certifies that no tampering or sabotage has occurred. The three-judge stay panel has no jurisdiction.\n4.     Upon expiration, an automatic Tribunal of Inquiry composed of twelve citizens chosen by lot from the National Registry of Citizens and three senior judges shall immediately convene and complete its investigation within sixty days. Any official found to have issued or ratified unnecessary, disproportionate, or fraudulent orders shall be guilty of high treason and punished accordingly under Article 15, with the penalty of death available for deliberate abuse that causes loss of life or liberty.",
  "precis": "Emergencies are precisely when the rights of citizens must remain most inviolable, for only an armed, free, and reasoning people can effectively respond to genuine threats.\n\nArticle 11 establishes an ironclad barrier against the abuse of emergency powers, rendering their weaponisation for ideological or tyrannical ends constitutionally impossible. No emergency may ever suspend or limit any provision of the Constitution or Charter. Temporary operational orders are confined to foreign invasion, declared war, or imminent catastrophes manifestly threatening physical survival, and are restricted solely to defence coordination, evacuation, or life-saving measures within the immediate zone of danger. Explicitly prohibited are the most common vectors of modern tyranny: firearm confiscation, asset freezing, speech or assembly restrictions, habeas corpus suspension, and medical mandates.\n\nOrders expire automatically after seventy-two hours unless ratified by a public, live-streamed three-quarters vote of the elected House, with renewals limited to seven days and total consecutive duration capped at thirty days. Any citizen may instantly challenge an order before a lot-drawn three-judge panel, triggering an automatic stay (except where the executive certifies immediate necessity to prevent loss of life in active natural disasters, or where the declaration protects the integrity of the National Registries of Citizens and Qualified Experts). Decisions are binding within twenty-four hours (or six hours expedited), with severe penalties for frivolous filings.\n\nUpon expiration, a Tribunal of Inquiry—twelve citizens chosen by lot and three senior judges—automatically convenes, completing its report within sixty days. Officials found to have issued or ratified unnecessary, disproportionate, or fraudulent orders commit high treason, with death available for deliberate abuse causing loss of life or liberty.\n\nThis framework neutralises the dangers of manufactured or perpetual crises amplified by twenty-first-century technology—digital surveillance, financial controls, algorithmic enforcement, or supranational manipulation—while preserving the European heritage of self-reliant citizenry capable of meeting existential threats without surrendering liberty. Meritocratic governance demands that power remain transparent, temporally bounded, and accountable, ensuring excellence prevails over panic and that posterity inherits a nation where freedom is never negotiable, even amid catastrophe."
}